[
    {
        "word": "a",
        "definition": "Used before singular countable nouns when the referent is unspecified.",
        "example": "She saw a cat on the fence."
    },
    {
        "word": "ability",
        "definition": "Possession of the means or skill to do something.",
        "example": "She has the ability to learn languages quickly."
    },
    {
        "word": "able",
        "definition": "Having the power, skill, or means to do something.",
        "example": "He is able to lift heavy weights."
    },
    {
        "word": "about",
        "definition": "On the subject of; concerning; approximately.",
        "example": "We talked about the new movie. The meeting is about to start."
    },
    {
        "word": "above",
        "definition": "At a higher level than something else; more than.",
        "example": "The birds were flying high above the trees. The temperature is above average."
    },
    {
        "word": "accept",
        "definition": "To agree to receive something; to consider as true or suitable.",
        "example": "She decided to accept the job offer. I accept your apology."
    },
    {
        "word": "according",
        "definition": "As stated by or in conformity with.",
        "example": "According to the weather forecast, it will rain tomorrow."
    },
    {
        "word": "account",
        "definition": "A report or description; an arrangement with a bank or business.",
        "example": "He gave a detailed account of his trip. I opened a savings account."
    },
    {
        "word": "across",
        "definition": "From one side to the other of something.",
        "example": "They walked across the bridge."
    },
    {
        "word": "act",
        "definition": "To take action; something done; a division of a play.",
        "example": "It’s time to act on this problem. It was a generous act of kindness."
    },
    {
        "word": "action",
        "definition": "The process of doing something; a deed or act.",
        "example": "The committee decided to take action. His actions were commendable."
    },
    {
        "word": "activity",
        "definition": "The state of being active; something done for pleasure or purpose.",
        "example": "There was a lot of activity in the market. Reading is a relaxing activity."
    },
    {
        "word": "actually",
        "definition": "In fact or reality.",
        "example": "I thought he was joking, but he was actually serious."
    },
    {
        "word": "add",
        "definition": "To join something to something else so as to increase the number or amount.",
        "example": "Please add sugar to my tea."
    },
    {
        "word": "address",
        "definition": "The location of a place; a formal speech; to speak to.",
        "example": "Please write your full address. The president gave an address. He addressed the crowd."
    },
    {
        "word": "administration",
        "definition": "The management of a company or organization; a government or its term of office.",
        "example": "She works in university administration. The new administration implemented changes."
    },
    {
        "word": "admit",
        "definition": "To confess to be true; to allow entry.",
        "example": "He had to admit he was wrong. Only ticket holders will be admitted."
    },
    {
        "word": "adult",
        "definition": "A person or animal that has grown to full size and strength.",
        "example": "The movie is for adults only."
    },
    {
        "word": "affect",
        "definition": "To influence or cause a change in.",
        "example": "The weather can affect your mood."
    },
    {
        "word": "after",
        "definition": "Following in time, order, or place.",
        "example": "Let’s go for a walk after dinner."
    },
    {
        "word": "again",
        "definition": "Another time; once more.",
        "example": "Please say that again."
    },
    {
        "word": "against",
        "definition": "In opposition to; in contact with.",
        "example": "They voted against the proposal. The rain beat against the window."
    },
    {
        "word": "age",
        "definition": "The length of time that someone or something has existed.",
        "example": "She is 25 years of age."
    },
    {
        "word": "agency",
        "definition": "A business or organization providing a service; the capacity to act.",
        "example": "He signed with a modeling agency. The protest gave them a sense of agency."
    },
    {
        "word": "agent",
        "definition": "A person who acts on behalf of another; a substance that produces an effect.",
        "example": "She is a real estate agent. The chemical is a powerful cleaning agent."
    },
    {
        "word": "ago",
        "definition": "Before the present time.",
        "example": "He left the house an hour ago."
    },
    {
        "word": "agree",
        "definition": "To have the same opinion; to consent.",
        "example": "They all agree on the plan. I agree to the terms."
    },
    {
        "word": "agreement",
        "definition": "A decision or arrangement between two or more parties.",
        "example": "They reached an agreement."
    },
    {
        "word": "ahead",
        "definition": "In a forward direction; in the future.",
        "example": "Go straight ahead. She’s planning ahead for her retirement."
    },
    {
        "word": "air",
        "definition": "The mixture of gases around the Earth; a feeling or manner.",
        "example": "Take a deep breath of fresh air. He had an air of confidence."
    },
    {
        "word": "all",
        "definition": "Every single one of; the complete amount or quantity.",
        "example": "All the students passed the exam. He ate all the cake."
    },
    {
        "word": "allow",
        "definition": "To give permission; to permit.",
        "example": "My parents allow me to stay out late. Smoking is not allowed."
    },
    {
        "word": "almost",
        "definition": "Very nearly, but not completely.",
        "example": "It’s almost midnight."
    },
    {
        "word": "alone",
        "definition": "Without anyone or anything else.",
        "example": "She likes to travel alone."
    },
    {
        "word": "along",
        "definition": "Moving in a continuous line on something; in addition to.",
        "example": "We walked along the beach. He brought a friend along."
    },
    {
        "word": "already",
        "definition": "Before the present time; before a particular past time.",
        "example": "They have already finished the work."
    },
    {
        "word": "also",
        "definition": "In addition; too.",
        "example": "She is a doctor and also a writer."
    },
    {
        "word": "although",
        "definition": "In spite of the fact that; even though.",
        "example": "Although it was raining, we went for a walk."
    },
    {
        "word": "always",
        "definition": "At all times; on every occasion.",
        "example": "She always arrives on time."
    },
    {
        "word": "American",
        "definition": "Relating to the United States of America.",
        "example": "He is an American citizen."
    },
    {
        "word": "among",
        "definition": "Situated in the middle of a group of people or things.",
        "example": "The house is hidden among the trees."
    },
    {
        "word": "amount",
        "definition": "A quantity of something; a sum of money.",
        "example": "A small amount of rain fell. He paid the full amount."
    },
    {
        "word": "analysis",
        "definition": "Detailed examination of something complex.",
        "example": "The report provided a thorough analysis of the data."
    },
    {
        "word": "and",
        "definition": "Used to connect words, clauses, or sentences that are to be taken jointly.",
        "example": "I like tea and coffee."
    },
    {
        "word": "animal",
        "definition": "A living organism that is not a plant or bacterium, usually able to move.",
        "example": "The zoo has many different animals."
    },
    {
        "word": "another",
        "definition": "One more; a different one.",
        "example": "Can I have another cup of tea? This is another problem we need to solve."
    },
    {
        "word": "answer",
        "definition": "A spoken or written reply to a question; a solution.",
        "example": "She gave the correct answer. What is the answer to this math problem?"
    },
    {
        "word": "any",
        "definition": "Used to refer to one or some of a thing or number of things, no matter how much or how many.",
        "example": "Do you have any questions? I can’t find any keys."
    },
    {
        "word": "anyone",
        "definition": "Any person.",
        "example": "Can anyone help me with this?"
    },
    {
        "word": "anything",
        "definition": "Any thing.",
        "example": "I can’t find anything to wear."
    },
    {
        "word": "appear",
        "definition": "To become visible; to seem.",
        "example": "The sun began to appear. He appears to be happy."
    },
    {
        "word": "apply",
        "definition": "To make a formal application; to be relevant; to put to use.",
        "example": "You should apply for the job. This rule does not apply here. Apply pressure to the wound."
    },
    {
        "word": "approach",
        "definition": "To come near; a way of dealing with something.",
        "example": "The train is approaching the station. We need a new approach to this problem."
    },
    {
        "word": "area",
        "definition": "A part of a place or region; a subject of study.",
        "example": "This is a residential area. His area of expertise is physics."
    },
    {
        "word": "argue",
        "definition": "To express a difference of opinion; to give reasons for or against something.",
        "example": "They always argue about money. She argued that the decision was wrong."
    },
    {
        "word": "arm",
        "definition": "Either of the two upper limbs of the human body; a branch of an organization; to provide with weapons.",
        "example": "He broke his arm. She is the head of the research arm of the company. The police were armed."
    },
    {
        "word": "around",
        "definition": "In a circle surrounding something; approximately; in the vicinity.",
        "example": "They sat around the campfire. It costs around fifty dollars. He lives around here."
    },
    {
        "word": "arrive",
        "definition": "To reach a place.",
        "example": "The train will arrive soon."
    },
    {
        "word": "art",
        "definition": "The expression or application of human creative skill and imagination.",
        "example": "She is studying art history."
    },
    {
        "word": "article",
        "definition": "A piece of writing in a newspaper or magazine; a particular item or thing; a word used with a noun.",
        "example": "I read an interesting article. She bought several articles of clothing. “The” is a definite article."
    },
    {
        "word": "artist",
        "definition": "A person who creates works of art.",
        "example": "He is a famous artist."
    },
    {
        "word": "as",
        "definition": "Used to describe the function or character of someone or something; while; because.",
        "example": "She works as a teacher. As I was leaving, the phone rang. As it was late, we went home."
    },
    {
        "word": "ask",
        "definition": "To inquire; to request.",
        "example": "Can I ask a question? She asked for help."
    },
    {
        "word": "assume",
        "definition": "To suppose to be the case, without proof.",
        "example": "I assume you’ll be there."
    },
    {
        "word": "at",
        "definition": "Used to indicate location, time, or state.",
        "example": "She is at home. The meeting is at 3 pm. He is at peace."
    },
    {
        "word": "attack",
        "definition": "To launch a violent assault on; a sudden onset of an illness.",
        "example": "The army decided to attack. He had an attack of the flu."
    },
    {
        "word": "attention",
        "definition": "The act of focusing the mind on something; notice or consideration.",
        "example": "Please pay attention. The problem requires immediate attention."
    },
    {
        "word": "attorney",
        "definition": "A person appointed to act for another in business or legal matters; a lawyer.",
        "example": "She consulted her attorney."
    },
    {
        "word": "audience",
        "definition": "A group of spectators or listeners; the people who read, watch, or listen to something.",
        "example": "The audience applauded loudly. The film reached a wide audience."
    },
    {
        "word": "author",
        "definition": "A writer of a book, article, or document.",
        "example": "He is the author of a best-selling novel."
    },
    {
        "word": "authority",
        "definition": "The power or right to give orders; official permission; an expert.",
        "example": "The police have the authority to arrest. She has authority on the subject."
    },
    {
        "word": "available",
        "definition": "Able to be used or obtained; not busy.",
        "example": "The information is available online. He is not available for a meeting today."
    },
    {
        "word": "avoid",
        "definition": "To keep away from or stop oneself from doing something.",
        "example": "Try to avoid traffic. He managed to avoid answering the question."
    },
    {
        "word": "away",
        "definition": "To or at a distance from a particular place; into a different position.",
        "example": "He walked away. Put the toys away."
    },
    {
        "word": "baby",
        "definition": "A very young child or animal.",
        "example": "She is holding her baby."
    },
    {
        "word": "back",
        "definition": "The rear surface of the body; the reverse side; in a ಹಿಂದಿನ direction or position.",
        "example": "He has a pain in his back. Write on the back of the paper. Go back to your seat."
    },
    {
        "word": "bad",
        "definition": "Of poor quality; unpleasant; harmful; wicked.",
        "example": "It was a bad experience. The food tasted bad. Smoking is bad for you."
    },
    {
        "word": "bag",
        "definition": "A container made of flexible material, with an opening at the top.",
        "example": "She carried a shopping bag."
    },
    {
        "word": "ball",
        "definition": "A round or spherical object used in games or sports.",
        "example": "Kick the ball."
    },
    {
        "word": "bank",
        "definition": "An institution where people keep money; the side of a river.",
        "example": "I need to go to the bank. They sat by the river bank."
    },
    {
        "word": "bar",
        "definition": "A long, rigid piece of material; a counter where drinks are served; to prevent.",
        "example": "A chocolate bar. He ordered a drink at the bar. The entrance was barred."
    },
    {
        "word": "base",
        "definition": "The bottom support of something; a foundation; a military station; a chemical substance.",
        "example": "The base of the statue. The base of their argument. An air force base."
    },
    {
        "word": "be",
        "definition": "To exist; to occur; used to link the subject of a sentence with a predicate.",
        "example": "I want to be happy. The event will be tomorrow. She is a doctor."
    },
    {
        "word": "beat",
        "definition": "To strike repeatedly; to defeat; to pulsate.",
        "example": "He beat the drum. Our team beat the opposition. His heart was beating fast."
    },
    {
        "word": "beautiful",
        "definition": "Pleasing to the senses or mind.",
        "example": "She is a beautiful person. What a beautiful sunset!"
    },
    {
        "word": "because",
        "definition": "For the reason that.",
        "example": "She was happy because she won."
    },
    {
        "word": "become",
        "definition": "To turn into; to come to be.",
        "example": "The caterpillar will become a butterfly. He wants to become a pilot."
    },
    {
        "word": "bed",
        "definition": "A piece of furniture for sleeping on.",
        "example": "I’m going to bed."
    },
    {
        "word": "before",
        "definition": "Earlier than someone or something; in front of.",
        "example": "She arrived before me. He stood before the judge."
    },
    {
        "word": "begin",
        "definition": "To start.",
        "example": "Let’s begin the meeting."
    },
    {
        "word": "behavior",
        "definition": "The way someone acts.",
        "example": "His behavior was unacceptable."
    },
    {
        "word": "behind",
        "definition": "At the rear of; in a previous position.",
        "example": "He is standing behind the door. She is behind in her studies."
    },
    {
        "word": "believe",
        "definition": "To accept as true; to have faith in.",
        "example": "I believe you. She believes in honesty."
    },
    {
        "word": "benefit",
        "definition": "An advantage or profit; a payment made by the state.",
        "example": "The new policy will be of great benefit. He receives unemployment benefits."
    },
    {
        "word": "best",
        "definition": "Of the most excellent or desirable type; in the most excellent way.",
        "example": "This is the best cake I’ve ever had. Do your best."
    },
    {
        "word": "better",
        "definition": "Of a more excellent or effective type; in a more excellent way.",
        "example": "This is a better solution. You should feel better now."
    },
    {
        "word": "between",
        "definition": "In the space separating two things; in the interval separating two points in time.",
        "example": "The town is located between two rivers. The meeting is between 2 and 3 pm."
    },
    {
        "word": "beyond",
        "definition": "At or to the farther side of; happening or continuing after.",
        "example": "The road continues beyond the mountains. The cost was beyond our budget."
    },
    {
        "word": "big",
        "definition": "Of considerable size, extent, or intensity; important.",
        "example": "It’s a big house. This is a big problem."
    },
    {
        "word": "bill",
        "definition": "A written or printed statement of money owed; a draft of a proposed law; a bird’s beak.",
        "example": "Pay the electricity bill. The bill was passed by Congress. The bird’s bill."
    },
    {
        "word": "billion",
        "definition": "The number 1,000,000,000.",
        "example": "The company made a profit of one billion dollars."
    },
    {
        "word": "bit",
        "definition": "A small piece or amount.",
        "example": "Can I have a little bit of cake?"
    },
    {
        "word": "black",
        "definition": "Of the darkest color, like coal or soot; without light.",
        "example": "She was wearing a black dress. The room was completely black."
    },
    {
        "word": "blood",
        "definition": "The red liquid that flows through the bodies of many animals.",
        "example": "He lost a lot of blood."
    },
    {
        "word": "blue",
        "definition": "Of the color of the clear sky or the sea.",
        "example": "The sky is blue."
    },
    {
        "word": "board",
        "definition": "A long, thin, flat piece of wood; a group of people who manage an organization; to get on a ship, train, etc.",
        "example": "Nail the board to the wall. The board of directors met. Please board the train now."
    },
    {
        "word": "body",
        "definition": "The whole physical structure of a person or animal; the main part.",
        "example": "Exercise is good for your body. The body of the car was damaged."
    },
    {
        "word": "book",
        "definition": "A written or printed work consisting of pages bound together; to reserve.",
        "example": "I read a good book. I need to book a hotel room."
    },
    {
        "word": "born",
        "definition": "Existing as a result of birth.",
        "example": "She was born in 1990."
    },
    {
        "word": "both",
        "definition": "Used to refer to two people or things, regarded together.",
        "example": "Both of them are coming."
    },
    {
        "word": "box",
        "definition": "A container with square or rectangular sides and a lid.",
        "example": "Put the toys in the box."
    },
    {
        "word": "boy",
        "definition": "A male child or youth.",
        "example": "My younger boy loves to play football."
    },
    {
        "word": "break",
        "definition": "To separate into pieces; to interrupt; a pause from work.",
        "example": "Don’t break the glass. Let’s take a break."
    },
    {
        "word": "bring",
        "definition": "To take or carry someone or something to a place.",
        "example": "Please bring me a glass of water."
    },
    {
        "word": "brother",
        "definition": "A male sibling.",
        "example": "My older brother lives abroad."
    },
    {
        "word": "budget",
        "definition": "An estimate of income and expenditure for a set period of time.",
        "example": "We need to stick to our budget."
    },
    {
        "word": "build",
        "definition": "To construct something; to create or develop.",
        "example": "They plan to build a new house. You need to build trust."
    },
    {
        "word": "building",
        "definition": "A structure with walls and a roof, such as a house or factory.",
        "example": "It’s a tall building."
    },
    {
        "word": "business",
        "definition": "A commercial enterprise; work or occupation; a matter of concern.",
        "example": "He started his own business. Mind your own business."
    },
    {
        "word": "but",
        "definition": "Used to introduce a contrasting phrase or clause; except for.",
        "example": "It was a small car, but it was fast. Everyone went but me."
    },
    {
        "word": "buy",
        "definition": "To obtain something in exchange for payment.",
        "example": "I want to buy a new phone."
    },
    {
        "word": "by",
        "definition": "Indicating the means of achieving something; near or beside; indicating the agent.",
        "example": "She traveled by train. The house is by the river. The book was written by a famous author."
    },
    {
        "word": "call",
        "definition": "To shout or speak loudly; to contact by telephone; a brief visit.",
        "example": "She received a phone call from her mother."
    },
    {
        "word": "camera",
        "definition": "An apparatus for taking photographs or videos.",
        "example": "He used his camera to capture the beautiful scenery."
    },
    {
        "word": "campaign",
        "definition": "An organized course of action to achieve a goal.",
        "example": "The politician is running a strong campaign."
    },
    {
        "word": "can",
        "definition": "To be able to; a metal container.",
        "example": "I can help you with that. / He opened a can of soup."
    },
    {
        "word": "cancer",
        "definition": "A disease caused by an uncontrolled division of abnormal cells.",
        "example": "Research continues to find a cure for cancer."
    },
    {
        "word": "candidate",
        "definition": "A person who applies for a job or is nominated for an election.",
        "example": "She is a strong candidate for the position."
    },
    {
        "word": "capital",
        "definition": "The most important city of a country/region; wealth.",
        "example": "Paris is the capital of France."
    },
    {
        "word": "car",
        "definition": "A road vehicle with four wheels.",
        "example": "We drove to the coast in my new car."
    },
    {
        "word": "card",
        "definition": "A piece of thick paper or plastic used for various purposes.",
        "example": "He sent a birthday card. / I paid with my credit card."
    },
    {
        "word": "care",
        "definition": "Provision of what is necessary for health/welfare; feel concern.",
        "example": "She took good care of her pet."
    },
    {
        "word": "career",
        "definition": "An occupation undertaken for a significant period of life.",
        "example": "She had a successful career as a doctor."
    },
    {
        "word": "carry",
        "definition": "To support and move from one place to another.",
        "example": "He helped her carry the heavy bags."
    },
    {
        "word": "case",
        "definition": "An instance of a particular situation; a container.",
        "example": "This is a difficult case to solve. / He packed his case."
    },
    {
        "word": "catch",
        "definition": "To intercept and hold something; to capture.",
        "example": "Try to catch the ball."
    },
    {
        "word": "cause",
        "definition": "A person/thing giving rise to an action; a principle or movement.",
        "example": "What was the cause of the accident?"
    },
    {
        "word": "cell",
        "definition": "The smallest structural/functional unit of an organism; a small room.",
        "example": "The human body is made up of millions of cells."
    },
    {
        "word": "center",
        "definition": "The middle point; a place where activity is concentrated.",
        "example": "The park is in the center of the city."
    },
    {
        "word": "central",
        "definition": "Of or in the middle; essential or important.",
        "example": "The library is in a central location."
    },
    {
        "word": "century",
        "definition": "A period of one hundred years.",
        "example": "The 20th century was a time of great change."
    },
    {
        "word": "certain",
        "definition": "Known for sure; specific but not named.",
        "example": "I am certain he will come. / A certain person called."
    },
    {
        "word": "certainly",
        "definition": "Without doubt; definitely.",
        "example": "He will certainly be there."
    },
    {
        "word": "chair",
        "definition": "A separate seat for one person, with a back and four legs.",
        "example": "Please take a chair."
    },
    {
        "word": "challenge",
        "definition": "A task or situation that tests someone’s abilities.",
        "example": "Learning a new language is a challenge."
    },
    {
        "word": "chance",
        "definition": "A possibility of something happening; an opportunity.",
        "example": "There’s a chance of rain. / He got a chance to travel."
    },
    {
        "word": "change",
        "definition": "To make or become different; the act or result of changing.",
        "example": "We need to change our plans. / There has been a big change."
    },
    {
        "word": "character",
        "definition": "The qualities that make a person or thing different; a person in a story.",
        "example": "He has a strong character. / She played the main character."
    },
    {
        "word": "charge",
        "definition": "To ask an amount as a price; to accuse; responsibility.",
        "example": "How much do you charge for this? / He was in charge of the project."
    },
    {
        "word": "check",
        "definition": "To examine the accuracy/quality of something; a pattern of squares.",
        "example": "Please check your work. / He wore a check shirt."
    },
    {
        "word": "child",
        "definition": "A young human being below the age of puberty.",
        "example": "The child was playing in the park."
    },
    {
        "word": "choice",
        "definition": "An act of choosing; a range of alternatives.",
        "example": "You have to make a choice. / There are many choices."
    },
    {
        "word": "choose",
        "definition": "To select from a number of alternatives.",
        "example": "Please choose the best option."
    },
    {
        "word": "church",
        "definition": "A building used for Christian worship.",
        "example": "They go to church every Sunday."
    },
    {
        "word": "citizen",
        "definition": "A legally recognized subject or national of a state or commonwealth.",
        "example": "Every citizen has the right to vote."
    },
    {
        "word": "city",
        "definition": "A large town.",
        "example": "London is a busy city."
    },
    {
        "word": "civil",
        "definition": "Of or relating to ordinary citizens and their concerns; non-military.",
        "example": "They discussed civil rights."
    },
    {
        "word": "claim",
        "definition": "To state or assert that something is the case; a formal demand.",
        "example": "He claims he saw a UFO. / She made an insurance claim."
    },
    {
        "word": "class",
        "definition": "A set or category of things having some property in common; a group of students.",
        "example": "She belongs to the working class. / The class was very noisy."
    },
    {
        "word": "clear",
        "definition": "Easy to perceive, understand, or interpret; transparent.",
        "example": "The instructions were clear. / The water was clear."
    },
    {
        "word": "clearly",
        "definition": "In a clear manner; without doubt.",
        "example": "He spoke clearly."
    },
    {
        "word": "close",
        "definition": "Near; to shut.",
        "example": "The store is close to my house. / Please close the door."
    },
    {
        "word": "coach",
        "definition": "A person who trains an athlete or team; a comfortable bus.",
        "example": "The football coach gave a team talk. / We took a coach to the city."
    },
    {
        "word": "cold",
        "definition": "Of a low temperature; lacking affection or warmth.",
        "example": "It’s very cold outside. / She gave him a cold look."
    },
    {
        "word": "collection",
        "definition": "The action or process of gathering things; a group of collected things.",
        "example": "The museum has a large art collection."
    },
    {
        "word": "college",
        "definition": "An educational institution, especially one providing higher education.",
        "example": "She is studying at college."
    },
    {
        "word": "color",
        "definition": "The property possessed by an object of producing different sensations on the eye as a result of the way it reflects 1 or emits light.",
        "example": "Red is my favorite color."
    },
    {
        "word": "come",
        "definition": "To move or travel towards the speaker or a specified place.",
        "example": "Please come here."
    },
    {
        "word": "commercial",
        "definition": "Concerned with or engaged in commerce; a television or radio advertisement.",
        "example": "It was a commercial success. / I saw a funny commercial on TV."
    },
    {
        "word": "common",
        "definition": "Occurring, found, or done often; shared.",
        "example": "This is a common problem. / They have a common interest."
    },
    {
        "word": "community",
        "definition": "A group of people living in the same place or having a particular characteristic in common.",
        "example": "The local community is very supportive."
    },
    {
        "word": "company",
        "definition": "A commercial business; the state of accompanying someone.",
        "example": "He works for a software company. / I enjoy your company."
    },
    {
        "word": "compare",
        "definition": "To estimate, measure, or note the similarity or dissimilarity between.",
        "example": "You can’t compare the two situations."
    },
    {
        "word": "computer",
        "definition": "An electronic device for storing and processing data.",
        "example": "I use my computer for work."
    },
    {
        "word": "concern",
        "definition": "Worry; a matter of interest or importance.",
        "example": "There is growing concern about the environment. / That is my concern."
    },
    {
        "word": "condition",
        "definition": "The state of something with regard to its appearance, quality, or functioning; a stipulation.",
        "example": "The car is in good condition. / Subject to the condition that you agree."
    },
    {
        "word": "conference",
        "definition": "A formal meeting for discussion.",
        "example": "They attended a business conference."
    },
    {
        "word": "Congress",
        "definition": "The national legislative body of the US, consisting of the Senate and the House of Representatives.",
        "example": "The bill was passed by Congress."
    },
    {
        "word": "consider",
        "definition": "To think carefully about; to regard as.",
        "example": "Please consider my offer. / I consider him a friend."
    },
    {
        "word": "consumer",
        "definition": "A person who purchases goods and services for personal use.",
        "example": "The new law protects consumer rights."
    },
    {
        "word": "contain",
        "definition": "To have or hold within; to comprise.",
        "example": "The box contains old books."
    },
    {
        "word": "continue",
        "definition": "To persist in an activity or process; to remain in existence.",
        "example": "Please continue reading. / The rain is expected to continue."
    },
    {
        "word": "control",
        "definition": "The power to influence or direct people’s behavior or the course of events; to determine the behavior of.",
        "example": "She has good control over her emotions. / He tried to control the situation."
    },
    {
        "word": "cost",
        "definition": "An amount that has to be paid or spent to get or achieve something; to require the payment of.",
        "example": "What is the cost of the ticket? / This car will cost a lot."
    },
    {
        "word": "could",
        "definition": "Used to indicate possibility or ability; used as the past tense of can.",
        "example": "I could help you if you need it. / She could swim when she was young."
    },
    {
        "word": "country",
        "definition": "A nation with its own government; rural areas.",
        "example": "France is a beautiful country. / They live in the country."
    },
    {
        "word": "couple",
        "definition": "Two people or things of the same sort considered together.",
        "example": "A couple of friends came over. / They are a happy couple."
    },
    {
        "word": "course",
        "definition": "A path or direction; a series of lessons; a dish served as part of a meal.",
        "example": "The river followed its natural course. / She took an English course."
    },
    {
        "word": "court",
        "definition": "A place where legal trials take place; a space for playing sports like tennis.",
        "example": "The trial is in court today. / They played tennis on the court."
    },
    {
        "word": "cover",
        "definition": "To place something over or in front of something else; a protective layer.",
        "example": "Please cover the food. / The book has an interesting cover."
    },
    {
        "word": "create",
        "definition": "To bring something into existence.",
        "example": "She wants to create her own business."
    },
    {
        "word": "crime",
        "definition": "An action or omission that constitutes an offense that may be prosecuted by the state and is punishable by law.",
        "example": "Crime has been 2 decreasing in the area."
    },
    {
        "word": "cultural",
        "definition": "Relating to the ideas, customs, and social behavior of a society.",
        "example": "They are interested in cultural exchange."
    },
    {
        "word": "culture",
        "definition": "The customs, arts, social institutions, and achievements of a particular nation, people, or group.",
        "example": "Japanese culture is very rich."
    },
    {
        "word": "cup",
        "definition": "A small bowl-shaped container for drinking from.",
        "example": "Would you like a cup of tea?"
    },
    {
        "word": "current",
        "definition": "Belonging to the present time; a flow of water, air, or electricity.",
        "example": "What is the current situation? / The current is very strong."
    },
    {
        "word": "customer",
        "definition": "A person who buys goods or services from a shop or business.",
        "example": "The customer was very satisfied."
    },
    {
        "word": "cut",
        "definition": "To divide into pieces with a knife or other sharp implement; a wound.",
        "example": "Please cut the cake. / He got a small cut on his finger."
    },
    {
        "word": "dark",
        "definition": "Having little or no light; (of a color) deep or intense.",
        "example": "It was dark outside. / She wore a dark blue dress."
    },
    {
        "word": "data",
        "definition": "Facts and statistics collected together for reference or analysis.",
        "example": "We need to analyze the data."
    },
    {
        "word": "daughter",
        "definition": "A girl or woman in relation to her parents.",
        "example": "His daughter is studying abroad."
    },
    {
        "word": "day",
        "definition": "A period of 24 hours; the period of light between sunrise and sunset.",
        "example": "It was a beautiful day."
    },
    {
        "word": "dead",
        "definition": "No longer living.",
        "example": "The tree was dead."
    },
    {
        "word": "deal",
        "definition": "An agreement entered into by two or more parties; to distribute cards; to handle.",
        "example": "They made a business deal. / He deals with complaints."
    },
    {
        "word": "death",
        "definition": "The action or fact of dying or being killed; the end of the life of a person or organism.",
        "example": "His death was a great loss."
    },
    {
        "word": "debate",
        "definition": "A formal discussion on a particular topic.",
        "example": "There was a lively debate about the issue."
    },
    {
        "word": "decade",
        "definition": "A period of ten years.",
        "example": "The last decade has seen many changes."
    },
    {
        "word": "decide",
        "definition": "To come to a resolution; to make a choice.",
        "example": "I need to decide what to do."
    },
    {
        "word": "decision",
        "definition": "A conclusion or resolution reached after consideration.",
        "example": "It was a difficult decision."
    },
    {
        "word": "deep",
        "definition": "Extending a long way down from the top or surface.",
        "example": "The water is very deep here."
    },
    {
        "word": "defense",
        "definition": "The action of protecting from attack; the case presented by or on behalf of the party accused of a crime.",
        "example": "They built a strong defense. / The lawyer presented the defense."
    },
    {
        "word": "degree",
        "definition": "A unit of measurement for angles or temperature; an academic rank conferred by a university.",
        "example": "The temperature is 20 degrees Celsius. / She has a degree in history."
    },
    {
        "word": "Democrat",
        "definition": "A member of the Democratic Party (especially in the US).",
        "example": "He is a registered Democrat."
    },
    {
        "word": "democratic",
        "definition": "Relating to or supporting democracy; based on the principle of elected representatives.",
        "example": "The country has a democratic government."
    },
    {
        "word": "describe",
        "definition": "To give an account in words of (someone or something), including all the relevant characteristics, qualities, or events.",
        "example": "Can you describe 3 the suspect?"
    },
    {
        "word": "design",
        "definition": "A plan or drawing produced to show the look and function or workings of a building, garment, or other object before it is built or made; 4 to plan and make.",
        "example": "The design of the building is modern. / She will design a new logo."
    },
    {
        "word": "despite",
        "definition": "Without being affected by; in spite of.",
        "example": "Despite the rain, we went for a walk."
    },
    {
        "word": "detail",
        "definition": "An individual feature, fact, or item.",
        "example": "Tell me all the details."
    },
    {
        "word": "determine",
        "definition": "To cause something to occur in a particular way; to ascertain or establish.",
        "example": "The weather will determine our plans. / They tried to determine the cause."
    },
    {
        "word": "develop",
        "definition": "To grow or cause to grow and become more mature, advanced, or elaborate.",
        "example": "The company needs to develop new products."
    },
    {
        "word": "development",
        "definition": "The process of developing or being developed.",
        "example": "The development of the town was rapid."
    },
    {
        "word": "die",
        "definition": "To stop living.",
        "example": "The old tree began to die."
    },
    {
        "word": "difference",
        "definition": "A point or way in which people or things are dissimilar.",
        "example": "What is the difference between the two?"
    },
    {
        "word": "different",
        "definition": "Not the same as another or each other; separate.",
        "example": "We have different opinions."
    },
    {
        "word": "difficult",
        "definition": "Needing much effort or skill to do or understand.",
        "example": "This is a difficult task."
    },
    {
        "word": "dinner",
        "definition": "The main meal of the day, taken in the evening or at midday.",
        "example": "We had chicken for dinner."
    },
    {
        "word": "direction",
        "definition": "A course along which someone or something moves; the management or supervision of something.",
        "example": "Which direction are you going? / He is in the direction of the company."
    },
    {
        "word": "director",
        "definition": "A person who is in charge of a department or organization; a person who directs a film or play.",
        "example": "She is the new sales director. / The film director won an award."
    },
    {
        "word": "discover",
        "definition": "To find something unexpectedly or in the course of a search.",
        "example": "They discovered a hidden cave."
    },
    {
        "word": "discuss",
        "definition": "To talk about something with another person or group.",
        "example": "We need to discuss the issue."
    },
    {
        "word": "discussion",
        "definition": "The action or process of talking about something in order to reach a decision or to exchange ideas.",
        "example": "We had a long discussion."
    },
    {
        "word": "disease",
        "definition": "A disorder of structure or function in an organism that produces specific symptoms.",
        "example": "He is suffering from a serious disease."
    },
    {
        "word": "do",
        "definition": "To perform an action, task, or function.",
        "example": "What should I do?"
    },
    {
        "word": "doctor",
        "definition": "A qualified practitioner of medicine.",
        "example": "I need to see a doctor."
    },
    {
        "word": "dog",
        "definition": "A domesticated carnivorous mammal that typically has a long snout, an acute sense of smell, and a barking, howling, or whining 5 voice.",
        "example": "My dog loves to play fetch."
    },
    {
        "word": "door",
        "definition": "A movable barrier at the entrance to a building or room.",
        "example": "Please close the door."
    },
    {
        "word": "down",
        "definition": "Towards or in a lower place, position, or state.",
        "example": "He sat down on the chair."
    },
    {
        "word": "draw",
        "definition": "To produce a picture or diagram; to pull or drag.",
        "example": "Can you draw a cat? / He draws strength from his friends."
    },
    {
        "word": "dream",
        "definition": "A series of thoughts, images, and sensations occurring in a person’s mind during sleep; a cherished aspiration.",
        "example": "I had a strange dream last night. / It’s my dream to travel the world."
    },
    {
        "word": "drive",
        "definition": "To operate and control the direction and speed of a motor vehicle; a journey by car.",
        "example": "He learned to drive last year. / We went for a drive along the coast."
    },
    {
        "word": "drop",
        "definition": "To fall or allow to fall; a small spherical or pear-shaped portion of liquid.",
        "example": "Be careful not to drop the glass. / There were a few drops of rain."
    },
    {
        "word": "drug",
        "definition": "A medicine or other substance which has a physiological effect when ingested or otherwise introduced into the body; 6 an illegal substance.",
        "example": "The doctor prescribed a drug for the pain."
    },
    {
        "word": "during",
        "definition": "Throughout the course of (a period of time).",
        "example": "He slept during the movie."
    },
    {
        "word": "each",
        "definition": "Used to refer to every one of two or more people or things, regarded separately.",
        "example": "Each student received a certificate."
    },
    {
        "word": "early",
        "definition": "Happening or done before the usual or expected time.",
        "example": "She woke up early."
    },
    {
        "word": "east",
        "definition": "The direction toward the point of the horizon where the sun rises at the equinoxes.",
        "example": "The sun rises in the east."
    },
    {
        "word": "easy",
        "definition": "Achieved without great effort; presenting few difficulties.",
        "example": "This task is very easy."
    },
    {
        "word": "eat",
        "definition": "To put food into the mouth and chew and swallow it.",
        "example": "We should eat dinner soon."
    },
    {
        "word": "economic",
        "definition": "Relating to economics or the economy.",
        "example": "They discussed the economic situation."
    },
    {
        "word": "economy",
        "definition": "The state of a country or region in terms of the production and consumption of goods and services and 7 the supply of money.",
        "example": "The global economy is recovering."
    },
    {
        "word": "edge",
        "definition": "The outside limit of an object, area, or surface; a sharp side.",
        "example": "Be careful near the edge of the cliff. / The knife has a sharp edge."
    },
    {
        "word": "education",
        "definition": "The process of receiving or giving systematic instruction.",
        "example": "Education is very important."
    },
    {
        "word": "effect",
        "definition": "A change which is a result or consequence of an action or other cause.",
        "example": "The medicine had no effect."
    },
    {
        "word": "effort",
        "definition": "Vigorous or determined attempt; physical or mental exertion.",
        "example": "It took a lot of effort to finish the project."
    },
    {
        "word": "eight",
        "definition": "The number equivalent to the sum of six and two; one more than seven.",
        "example": "She has eight apples."
    },
    {
        "word": "either",
        "definition": "Used to indicate a choice between two alternatives; used to indicate a similarity or agreement with something just stated (negative context).",
        "example": "You can have either tea or coffee. / I don’t like it, and he doesn’t either."
    },
    {
        "word": "election",
        "definition": "A formal and organized choice by vote of a person for a political office or other position.",
        "example": "The general election will be held next month."
    },
    {
        "word": "else",
        "definition": "In addition; besides.",
        "example": "Is there anything else you need?"
    },
    {
        "word": "employee",
        "definition": "A person employed for wages or salary, especially at non-executive level.",
        "example": "He is a valued employee of the company."
    },
    {
        "word": "end",
        "definition": "The final part of something; a limit or boundary.",
        "example": "This is the end of the road."
    },
    {
        "word": "energy",
        "definition": "The strength and vitality required for sustained physical or mental activity; power derived from the utilization of physical or chemical resources. 8",
        "example": "He has a lot of energy. / They are investing in renewable energy."
    },
    {
        "word": "enjoy",
        "definition": "To take delight or pleasure in an activity or occasion.",
        "example": "I enjoy reading books."
    },
    {
        "word": "enough",
        "definition": "As much or as many as required.",
        "example": "We have enough food for everyone."
    },
    {
        "word": "enter",
        "definition": "To come or go into (a place); to participate in a competition or exam.",
        "example": "Please enter the room. / She entered the competition."
    },
    {
        "word": "entire",
        "definition": "With no part left out; whole.",
        "example": "He ate the entire cake."
    },
    {
        "word": "environment",
        "definition": "The surroundings or conditions in which a person, animal, or plant lives or operates.",
        "example": "We need to protect the natural environment."
    },
    {
        "word": "environmental",
        "definition": "Relating to the natural world and the impact of human activity on its condition.",
        "example": "They are concerned about environmental issues."
    },
    {
        "word": "especially",
        "definition": "To a higher degree than is usual or expected; particularly.",
        "example": "I like all fruits, especially mangoes."
    },
    {
        "word": "establish",
        "definition": "To set up on a firm or permanent basis.",
        "example": "They decided to establish a new school."
    },
    {
        "word": "even",
        "definition": "Flat and smooth; despite; used to emphasize something surprising.",
        "example": "The surface was even. / Even though it was raining, they went out. / He didn’t even say hello."
    },
    {
        "word": "evening",
        "definition": "The period from late afternoon to night.",
        "example": "We watched a movie in the evening."
    },
    {
        "word": "event",
        "definition": "A thing that happens or takes place, especially one of importance.",
        "example": "It was a major historical event."
    },
    {
        "word": "ever",
        "definition": "At any time.",
        "example": "Have you ever been to Paris?"
    },
    {
        "word": "every",
        "definition": "Used to refer to all the individual members of a set without exception.",
        "example": "Every student passed the exam."
    },
    {
        "word": "everybody",
        "definition": "Every person.",
        "example": "Everybody was invited to the party."
    },
    {
        "word": "everyone",
        "definition": "Every person.",
        "example": "Everyone enjoyed the concert."
    },
    {
        "word": "everything",
        "definition": "All things.",
        "example": "I brought everything I need."
    },
    {
        "word": "evidence",
        "definition": "The available body of facts or information indicating whether a belief or proposition is true or valid.",
        "example": "There was no evidence 9 of foul play."
    },
    {
        "word": "exactly",
        "definition": "In a precise manner; used to confirm or agree.",
        "example": "That’s exactly what I mean."
    },
    {
        "word": "example",
        "definition": "A thing characteristic of its kind or illustrating a general rule.",
        "example": "This is a perfect example."
    },
    {
        "word": "executive",
        "definition": "A person with senior managerial responsibility in a business.",
        "example": "She is a top executive."
    },
    {
        "word": "exist",
        "definition": "To have actual being; to live.",
        "example": "Do ghosts exist?"
    },
    {
        "word": "expect",
        "definition": "To regard as likely to happen; to anticipate.",
        "example": "I expect him to arrive soon."
    },
    {
        "word": "experience",
        "definition": "The process of gaining knowledge or skill from doing, seeing, or feeling things; an event or occurrence.",
        "example": "She has a lot of work experience. / It was a new experience for me."
    },
    {
        "word": "expert",
        "definition": "A person who is very knowledgeable about or skilful in a particular area.",
        "example": "He is an expert in computer programming."
    },
    {
        "word": "explain",
        "definition": "To make something clear or understandable.",
        "example": "Can you explain this to me?"
    },
    {
        "word": "eye",
        "definition": "Each of a pair of globular organs of sight in the head of humans and vertebrate animals.",
        "example": "She has beautiful blue eyes."
    },
    {
        "word": "face",
        "definition": "The front part of a person’s head; to confront or deal with.",
        "example": "She has a friendly face. / We must face the challenge."
    },
    {
        "word": "fact",
        "definition": "A thing that is known or proved to be true.",
        "example": "It’s a proven fact."
    },
    {
        "word": "factor",
        "definition": "A circumstance, fact, or influence that contributes to a result.",
        "example": "Cost was a major factor in the decision."
    },
    {
        "word": "fail",
        "definition": "To be unsuccessful in achieving a goal; to stop operating.",
        "example": "He failed the exam. / The car engine failed."
    },
    {
        "word": "fall",
        "definition": "To move downward, typically rapidly and freely; the season after summer.",
        "example": "Leaves fall from the trees. / We go camping in the fall."
    },
    {
        "word": "family",
        "definition": "A group consisting of parents and children living together in a household.",
        "example": "My family is coming to visit."
    },
    {
        "word": "far",
        "definition": "At, to, or by a great distance.",
        "example": "The store is not far from here."
    },
    {
        "word": "fast",
        "definition": "Moving or capable of moving at high speed; firmly fixed or attached.",
        "example": "He is a fast runner. / The knot is tied fast."
    },
    {
        "word": "father",
        "definition": "A male parent.",
        "example": "My father taught me how to ride a bike."
    },
    {
        "word": "fear",
        "definition": "An unpleasant emotion caused by the threat of danger, pain, or harm.",
        "example": "She felt a sense of fear."
    },
    {
        "word": "federal",
        "definition": "Having or relating to a system of government in which several states form a unity but remain independent in internal 1 affairs.",
        "example": "The federal government made a new law."
    },
    {
        "word": "feel",
        "definition": "To perceive through the sense of touch; to experience an emotion or sensation.",
        "example": "Feel how soft this fabric is. / I feel happy today."
    },
    {
        "word": "feeling",
        "definition": "An emotional state or reaction.",
        "example": "He hurt her feelings."
    },
    {
        "word": "few",
        "definition": "A small number of.",
        "example": "I have a few books to read."
    },
    {
        "word": "field",
        "definition": "An area of open land, especially one planted with crops or pasture; an area of study or activity.",
        "example": "They are planting corn in the field. / He is an expert in his field."
    },
    {
        "word": "fight",
        "definition": "To take part in a violent struggle; a violent confrontation.",
        "example": "They had to fight for their rights. / There was a fight in the bar."
    },
    {
        "word": "figure",
        "definition": "A number; a person’s bodily shape; a diagram or illustration.",
        "example": "Sales figures are up. / She has a slim figure."
    },
    {
        "word": "fill",
        "definition": "To make or become full.",
        "example": "Please fill the bottle with water."
    },
    {
        "word": "film",
        "definition": "A movie or motion picture; a thin flexible strip of plastic coated with a photosensitive emulsion.",
        "example": "We watched a scary film. / He loaded the film into the camera."
    },
    {
        "word": "final",
        "definition": "Last in a series, process, or sequence.",
        "example": "This is the final episode."
    },
    {
        "word": "finally",
        "definition": "After a long delay, typically as the culmination of a series of events; at the end.",
        "example": "Finally, the rain stopped."
    },
    {
        "word": "financial",
        "definition": "Relating to finance.",
        "example": "He has some financial problems."
    },
    {
        "word": "find",
        "definition": "To discover something unexpectedly or in the course of a search; to ascertain.",
        "example": "I need to find my keys. / We find the situation unacceptable."
    },
    {
        "word": "fine",
        "definition": "Of high quality; good; acceptable; a sum of money exacted as a penalty.",
        "example": "It’s a fine day. / That’s fine with me. / He paid a parking fine."
    },
    {
        "word": "finger",
        "definition": "Each of the five digits of the hand.",
        "example": "He pointed with his finger."
    },
    {
        "word": "finish",
        "definition": "To bring a task or activity to an end; the end of an event or process.",
        "example": "Please finish your homework. / We are nearing the finish line."
    },
    {
        "word": "fire",
        "definition": "Combustion or burning; to shoot a gun; to dismiss an employee.",
        "example": "Be careful with fire. / The soldier fired his rifle. / The company fired him."
    },
    {
        "word": "firm",
        "definition": "Having a solid, almost unyielding surface or structure; a commercial company.",
        "example": "The ground was firm after the rain. / He works for a law firm."
    },
    {
        "word": "first",
        "definition": "Coming before all others in time, order, or importance.",
        "example": "This is my first time here."
    },
    {
        "word": "fish",
        "definition": "A cold-blooded aquatic vertebrate animal that has gills and fins.",
        "example": "We saw many colorful fish in the ocean."
    },
    {
        "word": "five",
        "definition": "The number equivalent to the sum of two and three; one more than four.",
        "example": "I have five fingers on each hand."
    },
    {
        "word": "floor",
        "definition": "The lower surface of a room; a story of a building.",
        "example": "The book fell on the floor. / We live on the third floor."
    },
    {
        "word": "fly",
        "definition": "To move through the air using wings; to travel by aircraft.",
        "example": "Birds can fly. / We will fly to New York tomorrow."
    },
    {
        "word": "focus",
        "definition": "The center of interest or activity; to concentrate attention on.",
        "example": "The focus of the meeting was the budget. / Please focus on your work."
    },
    {
        "word": "follow",
        "definition": "To go after or behind someone or something; to act according to.",
        "example": "Please follow me. / You should follow the rules."
    },
    {
        "word": "food",
        "definition": "Any nutritious substance that people or animals eat or drink, or that plants absorb, in order to maintain life and growth. 2",
        "example": "We need to buy some food."
    },
    {
        "word": "foot",
        "definition": "The lower extremity of the leg below the ankle; a unit of length.",
        "example": "He hurt his foot. / The room is ten foot wide."
    },
    {
        "word": "for",
        "definition": "In favor of; indicating the purpose of something; indicating a period of time.",
        "example": "Are you for or against the proposal? / This gift is for you. / We walked for an hour."
    },
    {
        "word": "force",
        "definition": "Strength or power; to make someone do something.",
        "example": "He used force to open the door. / They forced him to confess."
    },
    {
        "word": "foreign",
        "definition": "Of, from, in, or characteristic of a country or language other than one’s own.",
        "example": "He speaks several foreign languages."
    },
    {
        "word": "forget",
        "definition": "To fail to remember.",
        "example": "Don’t forget to call me."
    },
    {
        "word": "form",
        "definition": "The visible shape or configuration of something; a type or kind.",
        "example": "The sculpture had a strange form. / What form of transport did you use?"
    },
    {
        "word": "former",
        "definition": "Having previously been; belonging to an earlier time.",
        "example": "His former teacher visited him."
    },
    {
        "word": "forward",
        "definition": "In the direction that one is facing or moving; onward so as to make progress.",
        "example": "Move forward please. / They are working forward on the project."
    },
    {
        "word": "four",
        "definition": "The number equivalent to the sum of two and two; one more than three.",
        "example": "There are four seasons in a year."
    },
    {
        "word": "free",
        "definition": "Not under the control of another; able to act or be done as one wishes; costing nothing.",
        "example": "The bird was set free. / Feel free to ask questions. / Admission is free."
    },
    {
        "word": "friend",
        "definition": "A person with whom one has a bond of mutual affection, typically one that is not sexual.",
        "example": "She went to the movies with her friend."
    },
    {
        "word": "from",
        "definition": "Indicating the point of origin of a movement or action.",
        "example": "He came from London."
    },
    {
        "word": "front",
        "definition": "The foremost part or surface of something.",
        "example": "The front of the building is white."
    },
    {
        "word": "full",
        "definition": "Containing or holding as much or as many as possible; complete.",
        "example": "The bottle is full. / Read the full report."
    },
    {
        "word": "fund",
        "definition": "A sum of money saved or made available for a particular purpose; to provide with money.",
        "example": "They set up a fund for disaster relief. / The project is well funded."
    },
    {
        "word": "future",
        "definition": "The time regarded as still to come.",
        "example": "I am excited about the future."
    },
    {
        "word": "game",
        "definition": "An activity that one engages in for amusement or recreation.",
        "example": "Let’s play a game."
    },
    {
        "word": "garden",
        "definition": "A piece of ground adjoining a house, in which grass, flowers, and shrubs are grown.",
        "example": "We grow vegetables in our garden."
    },
    {
        "word": "gas",
        "definition": "An air-like fluid substance which expands freely to fill any space available, irrespective of its quantity; fuel for vehicles.",
        "example": "Natural gas is used for heating. / We need to get gas for the car."
    },
    {
        "word": "general",
        "definition": "Affecting or concerning all or most people, things, or places; not specific.",
        "example": "This is a general rule."
    },
    {
        "word": "generation",
        "definition": "All of the people born and living at about the same time.",
        "example": "My generation grew up with computers."
    },
    {
        "word": "get",
        "definition": "To obtain, acquire, or receive; to become.",
        "example": "I need to get some milk. / It’s getting late."
    },
    {
        "word": "girl",
        "definition": "A female child or adolescent.",
        "example": "The little girl was laughing."
    },
    {
        "word": "give",
        "definition": "To present voluntarily and without expecting compensation; to hand over.",
        "example": "Please give me a pen."
    },
    {
        "word": "glass",
        "definition": "A hard, brittle substance, typically transparent; a container for drinks.",
        "example": "The window is made of glass. / He drank a glass of water."
    },
    {
        "word": "go",
        "definition": "To move from one place to another; to leave.",
        "example": "Let’s go to the park."
    },
    {
        "word": "goal",
        "definition": "The object of a person’s ambition or effort; a score in a game.",
        "example": "My goal is to finish my degree. / He scored a goal."
    },
    {
        "word": "good",
        "definition": "To be desired or approved of; having the required qualities.",
        "example": "She is a good student. / This is a good idea."
    },
    {
        "word": "government",
        "definition": "The system by which a state or community is controlled.",
        "example": "The government announced new policies."
    },
    {
        "word": "great",
        "definition": "Of an extent, amount, or intensity considerably above the normal or average; of considerable importance or reputation.",
        "example": "It was a great party. / He is a great writer."
    },
    {
        "word": "green",
        "definition": "Of the color between blue and yellow in the spectrum; the color of grass or leaves.",
        "example": "The leaves are green in spring."
    },
    {
        "word": "ground",
        "definition": "The solid surface of the earth.",
        "example": "The ball fell on the ground."
    },
    {
        "word": "group",
        "definition": "A number of people or things that are located close together or are associated.",
        "example": "A group of students were talking."
    },
    {
        "word": "grow",
        "definition": "To increase in size, number, or intensity; to cultivate (plants).",
        "example": "Children grow very fast. / We grow our own vegetables."
    },
    {
        "word": "growth",
        "definition": "The process of increasing in size, number, or intensity.",
        "example": "Economic growth is important."
    },
    {
        "word": "guess",
        "definition": "To estimate or suppose (something) without sufficient information.",
        "example": "Can you guess my age?"
    },
    {
        "word": "gun",
        "definition": "A weapon incorporating a metal tube from which bullets are fired.",
        "example": "The police officer carried a gun."
    },
    {
        "word": "guy",
        "definition": "A man; a fellow.",
        "example": "He’s a nice guy."
    },
    {
        "word": "hair",
        "definition": "Fine filamentous strands growing from the skin of mammals.",
        "example": "She has long, brown hair."
    },
    {
        "word": "half",
        "definition": "Either of two equal or corresponding parts of something.",
        "example": "He ate half of the apple."
    },
    {
        "word": "hand",
        "definition": "The end part of a person’s arm, including the fingers and thumb; to give something to someone.",
        "example": "Shake my hand. / Please hand me the book."
    },
    {
        "word": "hang",
        "definition": "To suspend or be suspended from above with the lower part dangling.",
        "example": "Hang your coat on the hook."
    },
    {
        "word": "happen",
        "definition": "To take place; occur.",
        "example": "What happened yesterday?"
    },
    {
        "word": "happy",
        "definition": "Feeling or showing pleasure or contentment.",
        "example": "She is very happy."
    },
    {
        "word": "hard",
        "definition": "Solid, firm, and resistant to pressure; difficult to do or understand.",
        "example": "The rock is very hard. / This is a hard question."
    },
    {
        "word": "have",
        "definition": "To possess, own, or hold; used as an auxiliary verb.",
        "example": "I have a car. / I have finished my work."
    },
    {
        "word": "he",
        "definition": "Used to refer to a male person or animal previously mentioned or easily identified.",
        "example": "He is my brother."
    },
    {
        "word": "head",
        "definition": "The upper part of the human body, or the front part of the body of an animal; the leader or chief.",
        "example": "He nodded his head. / She is the head of the department."
    },
    {
        "word": "health",
        "definition": "The state of being free from illness or injury.",
        "example": "Exercise is good for your health."
    },
    {
        "word": "hear",
        "definition": "To perceive with the ear the sound made by (someone or something).",
        "example": "Can you hear me?"
    },
    {
        "word": "heart",
        "definition": "A hollow muscular organ that pumps the blood through the circulatory system.",
        "example": "He has a kind heart."
    },
    {
        "word": "heat",
        "definition": "The quality of being hot; to make or become hot.",
        "example": "The heat in the desert is intense. / Heat the soup in a pan."
    },
    {
        "word": "heavy",
        "definition": "Of great weight; of high density.",
        "example": "The box is very heavy."
    },
    {
        "word": "help",
        "definition": "To make it easier or possible for someone to do something by offering them one’s services or resources; the action of helping.",
        "example": "Can you help me? / Thank you for your help."
    },
    {
        "word": "her",
        "definition": "Belonging to or associated with a female person or animal previously mentioned or easily identified; the objective case of she.",
        "example": "That is her book. / I saw her yesterday."
    },
    {
        "word": "here",
        "definition": "In, at, or to this place or position.",
        "example": "Please come here."
    },
    {
        "word": "herself",
        "definition": "Used as a reflexive pronoun; used for emphasis.",
        "example": "She dressed herself. / She did it herself."
    },
    {
        "word": "high",
        "definition": "Of great vertical extent; above average intensity, degree, or amount.",
        "example": "The mountain is very high. / Prices are high."
    },
    {
        "word": "him",
        "definition": "Used as the object of a verb or preposition to refer to a male person or animal previously mentioned or easily identified. 3",
        "example": "I saw him at the store."
    },
    {
        "word": "himself",
        "definition": "Used as a reflexive pronoun; used for emphasis.",
        "example": "He hurt himself. / He built it himself."
    },
    {
        "word": "his",
        "definition": "Belonging to or associated with a male person or animal previously mentioned or easily identified.",
        "example": "That is his car."
    },
    {
        "word": "history",
        "definition": "The study of past events, particularly in human affairs; the whole series of past events connected with someone or something. 4",
        "example": "We are studying ancient history. / The company has a long history."
    },
    {
        "word": "hit",
        "definition": "To strike forcefully with the hand or a hard object; to reach.",
        "example": "He hit the ball. / Sales hit a new record."
    },
    {
        "word": "hold",
        "definition": "To grasp, carry, or support; to keep possession of.",
        "example": "Hold my hand. / She holds the record."
    },
    {
        "word": "home",
        "definition": "The place where one lives permanently, especially as a member of a family or household.",
        "example": "I’m going home now."
    },
    {
        "word": "hope",
        "definition": "A feeling of expectation and desire for a certain thing to happen.",
        "example": "I hope you have a good time."
    },
    {
        "word": "hospital",
        "definition": "An institution providing medical and surgical treatment and nursing care for sick or injured people.",
        "example": "She is recovering in the hospital."
    },
    {
        "word": "hot",
        "definition": "Having or giving off heat; having a high temperature.",
        "example": "Be careful, the plate is hot."
    },
    {
        "word": "hotel",
        "definition": "An establishment providing accommodations, meals, and other services for travelers and tourists.",
        "example": "We stayed at a nice hotel."
    },
    {
        "word": "hour",
        "definition": "A period of time equal to sixty minutes.",
        "example": "The meeting lasted for one hour."
    },
    {
        "word": "house",
        "definition": "A building for human habitation, especially one that is detached and typically occupied by a single family.",
        "example": "They bought a new house."
    },
    {
        "word": "how",
        "definition": "In what way or manner; by what means.",
        "example": "How did you do that?"
    },
    {
        "word": "however",
        "definition": "Used to introduce a statement that contrasts with or contradicts something that has been said previously.",
        "example": "He was feeling sick; however, he went to work."
    },
    {
        "word": "huge",
        "definition": "Extremely large.",
        "example": "They saw a huge elephant."
    },
    {
        "word": "human",
        "definition": "Relating to or characteristic of people or humankind.",
        "example": "We are all human."
    },
    {
        "word": "hundred",
        "definition": "The number equivalent to the product of ten and ten; ten times ten.",
        "example": "There are one hundred years in a century."
    },
    {
        "word": "husband",
        "definition": "A married man considered in relation to his spouse.",
        "example": "Her husband is a doctor."
    },
    {
        "word": "I",
        "definition": "Used by a speaker or writer to refer to himself or herself.",
        "example": "I am going to the store."
    },
    {
        "word": "idea",
        "definition": "A thought or suggestion as to a possible course of action; a concept or impression.",
        "example": "I have a great idea!"
    },
    {
        "word": "identify",
        "definition": "To recognize or establish as being a particular person or thing.",
        "example": "Can you identify the suspect?"
    },
    {
        "word": "if",
        "definition": "Introducing a conditional clause; whether.",
        "example": "If it rains, we will stay inside. / I wonder if he will come."
    },
    {
        "word": "image",
        "definition": "A representation of the external form of a person or thing in art; a visual representation of something.",
        "example": "The painting contains a beautiful image. / She has a good image in the public eye."
    },
    {
        "word": "imagine",
        "definition": "To form a mental image of something not present or existing; to think.",
        "example": "Can you imagine living on the moon?"
    },
    {
        "word": "impact",
        "definition": "The action of one object coming forcibly into contact with another; a strong effect on someone or something.",
        "example": "The impact of the car crash was severe. / The new policy had a big impact."
    },
    {
        "word": "important",
        "definition": "Of great significance or value; crucial.",
        "example": "This is an important meeting."
    },
    {
        "word": "improve",
        "definition": "To make or become better.",
        "example": "He needs to improve his English."
    },
    {
        "word": "in",
        "definition": "Expressing location or inclusion within a space; expressing a period of time.",
        "example": "The book is in the bag. / I will see you in an hour."
    },
    {
        "word": "include",
        "definition": "To comprise or contain as part of a whole.",
        "example": "The price includes breakfast."
    },
    {
        "word": "including",
        "definition": "Comprising or considering as part of a whole.",
        "example": "Everyone was invited, including the neighbors."
    },
    {
        "word": "increase",
        "definition": "To become greater in size, amount, or intensity; the act of increasing.",
        "example": "Prices will increase next month. / There was an increase in sales."
    },
    {
        "word": "indeed",
        "definition": "Used to emphasize a statement or response confirming something already suggested.",
        "example": "It was a very cold day indeed."
    },
    {
        "word": "indicate",
        "definition": "To point out; to show.",
        "example": "Please indicate your preference."
    },
    {
        "word": "individual",
        "definition": "Single; separate; a single human being.",
        "example": "This is for individual use only. / He is a remarkable individual."
    },
    {
        "word": "industry",
        "definition": "Economic activity concerned with the processing of raw materials and manufacture of goods; a particular area of economic activity.",
        "example": "The car industry is very competitive."
    },
    {
        "word": "information",
        "definition": "Facts provided or learned about something or someone.",
        "example": "I need more information."
    },
    {
        "word": "inside",
        "definition": "On or to the inner side or part of something.",
        "example": "Let’s go inside."
    },
    {
        "word": "instead",
        "definition": "As an alternative.",
        "example": "I don’t want coffee; I’ll have tea instead."
    },
    {
        "word": "institution",
        "definition": "A society or organization founded for a religious, educational, social, or similar purpose.",
        "example": "Harvard is a well-known institution."
    },
    {
        "word": "interest",
        "definition": "The feeling of wanting to know or learn about something; money paid for the use of money.",
        "example": "I have a strong interest in history. / He paid interest on the loan."
    },
    {
        "word": "interesting",
        "definition": "Arousing curiosity or interest; holding the attention.",
        "example": "It was a very interesting book."
    },
    {
        "word": "international",
        "definition": "Existing, occurring, or carried on between nations.",
        "example": "The company operates on an international level."
    },
    {
        "word": "interview",
        "definition": "A meeting of people face to face, especially for consultation.",
        "example": "She has a job interview tomorrow."
    },
    {
        "word": "into",
        "definition": "Expressing movement or direction toward the inside of something.",
        "example": "He walked into the room."
    },
    {
        "word": "investment",
        "definition": "The action or process of investing money for profit or material result.",
        "example": "Real estate is a good investment."
    },
    {
        "word": "involve",
        "definition": "To include something as a necessary part or consequence; to cause someone to be included.",
        "example": "The plan involves a lot of work. / He got involved in politics."
    },
    {
        "word": "issue",
        "definition": "An important topic for discussion or debate; a problem.",
        "example": "Climate change is a major issue. / We faced some technical issues."
    },
    {
        "word": "it",
        "definition": "Used to refer to a thing previously mentioned or easily identified; used as a subject in statements about time, distance, or weather.",
        "example": "Where is my book? It is on the table. / It is raining."
    },
    {
        "word": "item",
        "definition": "An individual article or unit, especially one that is part of a list, collection, or set.",
        "example": "Please check each item on the list."
    },
    {
        "word": "its",
        "definition": "Belonging to or associated with a thing previously mentioned or easily identified.",
        "example": "The company is known for its innovative products."
    },
    {
        "word": "itself",
        "definition": "Used as a reflexive pronoun; used for emphasis.",
        "example": "The door closed by itself. / The city itself is beautiful."
    },
    {
        "word": "job",
        "definition": "A paid position of regular employment.",
        "example": "He got a new job."
    },
    {
        "word": "join",
        "definition": "To link; to become a member of.",
        "example": "Join the two pieces together. / She joined the club."
    },
    {
        "word": "just",
        "definition": "Exactly; only; a short time ago.",
        "example": "That’s just what I wanted. / I need just five minutes. / He just left."
    },
    {
        "word": "keep",
        "definition": "To have or retain possession of; to continue in a specified condition or position.",
        "example": "You can keep the change. / Keep calm and carry on."
    },
    {
        "word": "key",
        "definition": "A small piece of shaped metal used to open a lock; essential or crucial.",
        "example": "I lost my key. / This is a key factor."
    },
    {
        "word": "kid",
        "definition": "A child or young person.",
        "example": "The kids are playing outside."
    },
    {
        "word": "kill",
        "definition": "To cause the death of a person, animal, or plant.",
        "example": "The snake can kill its prey."
    },
    {
        "word": "kind",
        "definition": "A group of people or things having similar characteristics; caring or friendly.",
        "example": "What kind of music do you like? / She is a very kind person."
    },
    {
        "word": "kitchen",
        "definition": "A room or area where food is prepared and cooked.",
        "example": "I am cooking dinner in the kitchen."
    },
    {
        "word": "know",
        "definition": "To be aware of through observation, inquiry, or information.",
        "example": "I know the answer."
    },
    {
        "word": "knowledge",
        "definition": "Facts, information, and skills acquired through experience or education.",
        "example": "He has a lot of knowledge about history."
    },
    {
        "word": "land",
        "definition": "The part of the earth’s surface that is not covered by water; to arrive on the ground.",
        "example": "They own a piece of land. / The plane landed safely."
    },
    {
        "word": "language",
        "definition": "The method of human communication, either spoken or written.",
        "example": "English is a widely spoken language."
    },
    {
        "word": "large",
        "definition": "Of considerable size or extent.",
        "example": "They live in a large house."
    },
    {
        "word": "last",
        "definition": "Coming after all others in time or order; the most recent.",
        "example": "This is the last chapter. / I saw her last week."
    },
    {
        "word": "late",
        "definition": "Happening or doing something after the planned, expected, or usual time.",
        "example": "She arrived late for the meeting."
    },
    {
        "word": "later",
        "definition": "At a time subsequent to the time mentioned; afterwards.",
        "example": "I’ll call you later."
    },
    {
        "word": "laugh",
        "definition": "To make sounds and movements of the face that express amusement.",
        "example": "We all laughed at his joke."
    },
    {
        "word": "law",
        "definition": "The system of rules which a particular country or community recognizes as regulating the actions of its members.",
        "example": "It is against the law to steal."
    },
    {
        "word": "lawyer",
        "definition": "A person who practices or studies law, especially (in England) a solicitor or (in the US) an attorney.",
        "example": "She consulted a lawyer."
    },
    {
        "word": "lay",
        "definition": "To put something down gently or carefully; to place in a horizontal position.",
        "example": "Lay the book on the table."
    },
    {
        "word": "lead",
        "definition": "To guide someone or something in a particular direction; a position of advantage; a soft heavy ductile metallic element.",
        "example": "He will lead the team. / They have a significant lead. / The pipe is made of lead."
    },
    {
        "word": "leader",
        "definition": "A person who leads or commands a group, organization, or country.",
        "example": "She is a good leader."
    },
    {
        "word": "learn",
        "definition": "To gain or acquire knowledge of or skill in (something) by study, experience, or being taught.",
        "example": "I want to learn Spanish."
    },
    {
        "word": "least",
        "definition": "Smallest in amount, extent, or significance.",
        "example": "That was the least I could do."
    },
    {
        "word": "leave",
        "definition": "To go away from; to depart.",
        "example": "They decided to leave early."
    },
    {
        "word": "left",
        "definition": "On or toward the side of a human body or of a thing which is to the west when the person or thing is facing north; remaining.",
        "example": "Turn left at the corner. / There is some food left."
    },
    {
        "word": "leg",
        "definition": "Each of the limbs on which a person or animal walks and stands.",
        "example": "He broke his leg."
    },
    {
        "word": "legal",
        "definition": "Of, based on, or concerned with the law.",
        "example": "It is a legal document."
    },
    {
        "word": "less",
        "definition": "A smaller amount of; to a smaller extent.",
        "example": "I have less money than before."
    },
    {
        "word": "let",
        "definition": "To allow.",
        "example": "Let me help you."
    },
    {
        "word": "letter",
        "definition": "A character representing one or more of the sounds used in speech; a written or printed communication.",
        "example": "The first letter of the alphabet is A. / I sent a letter to my friend."
    },
    {
        "word": "level",
        "definition": "A position on a scale of amount, quality, or ability; flat and even.",
        "example": "The water level is rising. / The surface is level."
    },
    {
        "word": "lie",
        "definition": "To be in a horizontal position; to make a false statement.",
        "example": "Lie down and rest. / Don’t lie to me."
    },
    {
        "word": "life",
        "definition": "The existence of an individual human being or animal; the period between birth and death.",
        "example": "Life is beautiful. / He lived a long life."
    },
    {
        "word": "light",
        "definition": "The natural agent that stimulates sight and makes things visible; not heavy.",
        "example": "Turn on the light. / The box was very light."
    },
    {
        "word": "like",
        "definition": "Having the same characteristics as; similar to; to find agreeable or appealing.",
        "example": "She looks like her mother. / I like ice cream."
    },
    {
        "word": "likely",
        "definition": "Having a high probability of occurring or being true.",
        "example": "It is likely to rain tomorrow."
    },
    {
        "word": "line",
        "definition": "A long, narrow mark or band; a row of people or things.",
        "example": "Draw a straight line. / Please stand in line."
    },
    {
        "word": "list",
        "definition": "A series of items of a similar type recorded contiguously.",
        "example": "Make a shopping list."
    },
    {
        "word": "listen",
        "definition": "To give attention to a sound or to someone speaking.",
        "example": "Please listen carefully."
    },
    {
        "word": "little",
        "definition": "Small in size, amount, or degree.",
        "example": "She has a little dog."
    },
    {
        "word": "live",
        "definition": "To be alive; to reside in a particular place.",
        "example": "He wants to live a long time. / They live in a small apartment."
    },
    {
        "word": "local",
        "definition": "Belonging or relating to a particular area or neighborhood.",
        "example": "We ate at a local restaurant."
    },
    {
        "word": "long",
        "definition": "Measuring a great distance from end to end; a long period of time.",
        "example": "She has long hair. / It was a long journey."
    },
    {
        "word": "look",
        "definition": "To direct one’s gaze in a specified direction; an act of looking.",
        "example": "Look at that bird! / She gave me a strange look."
    },
    {
        "word": "lose",
        "definition": "To be deprived of or cease to have or retain (something); to fail to win (a contest or game).",
        "example": "Be careful not to lose your keys. / Our team might lose."
    },
    {
        "word": "loss",
        "definition": "The fact or process of losing something; a person or thing that is lost.",
        "example": "He suffered a great loss. / The death was a terrible loss."
    },
    {
        "word": "lot",
        "definition": "A large number or amount; a parcel of land.",
        "example": "There are a lot of people here. / They bought a building lot."
    },
    {
        "word": "love",
        "definition": "An intense feeling of deep affection; a great interest and pleasure in something.",
        "example": "I love my family. / He has a love of music."
    },
    {
        "word": "low",
        "definition": "Of small or limited size, amount, or intensity; not high.",
        "example": "The water level is low. / He spoke in a low voice."
    },
    {
        "word": "machine",
        "definition": "An apparatus using mechanical power and having several parts, each with a definite function and together performing a particular task. 1",
        "example": "He is good at fixing machines."
    },
    {
        "word": "magazine",
        "definition": "A periodical publication containing articles and illustrations, typically on a particular subject or aimed at a particular readership. 2",
        "example": "I read an interesting article in a magazine."
    },
    {
        "word": "main",
        "definition": "Largest in size or amount, or most important.",
        "example": "The main reason is the cost."
    },
    {
        "word": "maintain",
        "definition": "To keep something in good condition; to continue.",
        "example": "You must maintain your car regularly. / He maintained his innocence."
    },
    {
        "word": "major",
        "definition": "Important, serious, or significant.",
        "example": "This is a major problem."
    },
    {
        "word": "majority",
        "definition": "The greater number.",
        "example": "The majority of people agreed."
    },
    {
        "word": "make",
        "definition": "To form something by putting parts together or combining substances; to cause to exist or happen.",
        "example": "Can you make a cake? / He will make a decision."
    },
    {
        "word": "man",
        "definition": "An adult male human being.",
        "example": "A tall man walked into the room."
    },
    {
        "word": "manage",
        "definition": "To be in charge of; to succeed in doing something, especially something difficult.",
        "example": "She manages a large team. / I can manage on my own."
    },
    {
        "word": "management",
        "definition": "The process of dealing with or controlling things or people; the people in charge.",
        "example": "The project needs better management. / The management made a decision."
    },
    {
        "word": "manager",
        "definition": "A person responsible for controlling or administering all or part of a company or organization.",
        "example": "He spoke to the manager."
    },
    {
        "word": "many",
        "definition": "A large number of.",
        "example": "There are many books on the shelf."
    },
    {
        "word": "market",
        "definition": "An area or arena in which commercial dealings are conducted.",
        "example": "We went to the local market."
    },
    {
        "word": "marriage",
        "definition": "The legally or formally recognized union of two people as partners in a personal relationship.",
        "example": "They celebrated their 50th wedding marriage."
    },
    {
        "word": "material",
        "definition": "The matter from which a thing is or can be made; information or ideas used to write something.",
        "example": "This dress is made of soft material. / He collected material for his book."
    },
    {
        "word": "matter",
        "definition": "Physical substance in general; a subject or situation under consideration.",
        "example": "The sofa is made of a soft matter. / It’s a matter of opinion."
    },
    {
        "word": "may",
        "definition": "Expressing possibility; expressing permission.",
        "example": "It may rain tomorrow. / You may leave now."
    },
    {
        "word": "maybe",
        "definition": "Perhaps; possibly.",
        "example": "Maybe we should go home."
    },
    {
        "word": "me",
        "definition": "Used by a speaker to refer to himself or herself as the object of a verb or preposition.",
        "example": "Give the book to me."
    },
    {
        "word": "mean",
        "definition": "To intend to convey, indicate, or refer to (a particular thing or notion); cruel or unkind.",
        "example": "What does this word mean? / He is a mean person."
    },
    {
        "word": "measure",
        "definition": "To ascertain the size, amount, or degree of something; a plan of action.",
        "example": "Can you measure the room? / They took measures to prevent flooding."
    },
    {
        "word": "media",
        "definition": "The main means of mass communication (broadcasting, publishing, and the internet).",
        "example": "The media reported the event."
    },
    {
        "word": "medical",
        "definition": "Relating to the science or practice of medicine.",
        "example": "He needed urgent medical attention."
    },
    {
        "word": "meet",
        "definition": "To come into the presence or company of someone by chance or arrangement; to satisfy or fulfill.",
        "example": "Let’s meet for coffee. / The product must meet safety standards."
    },
    {
        "word": "meeting",
        "definition": "An assembly of people for a particular purpose.",
        "example": "We have a team meeting this afternoon."
    },
    {
        "word": "member",
        "definition": "A person, animal, or thing belonging to a group or society.",
        "example": "He is a member of the club."
    },
    {
        "word": "memory",
        "definition": "The faculty by which the mind stores and remembers information.",
        "example": "She has a good memory."
    },
    {
        "word": "mention",
        "definition": "To refer to something briefly and without going into detail.",
        "example": "Did he mention his trip?"
    },
    {
        "word": "message",
        "definition": "A verbal, written, or recorded communication sent to or left for a recipient who cannot be contacted directly.",
        "example": "I left you a message."
    },
    {
        "word": "method",
        "definition": "A particular procedure for accomplishing or approaching something.",
        "example": "What is your method for solving this problem?"
    },
    {
        "word": "middle",
        "definition": "The point or position halfway between two extremes; the central part.",
        "example": "He stood in the middle of the room."
    },
    {
        "word": "might",
        "definition": "Expressing possibility; past tense of may.",
        "example": "It might rain later. / He might have been here earlier."
    },
    {
        "word": "military",
        "definition": "Relating to or characteristic of soldiers or armed forces.",
        "example": "He is in the military."
    },
    {
        "word": "million",
        "definition": "The number equivalent to the product of a thousand and a thousand; 1,000,000.",
        "example": "The company made a million dollars in profit."
    },
    {
        "word": "mind",
        "definition": "The private inner experience of conscious organisms; the faculty of consciousness and thought.",
        "example": "She has a brilliant mind."
    },
    {
        "word": "minute",
        "definition": "A period of time equal to sixty seconds; a very short time.",
        "example": "The meeting lasted for thirty minutes. / I’ll be there in a minute."
    },
    {
        "word": "miss",
        "definition": "To fail to hit, reach, or catch something; to feel the absence of.",
        "example": "Don’t miss the bus. / I miss my family."
    },
    {
        "word": "mission",
        "definition": "An important assignment given to a person or group; a religious expedition.",
        "example": "Their mission is to find a cure. / The church sent out missionaries."
    },
    {
        "word": "model",
        "definition": "A three-dimensional representation of a person or thing or of a proposed structure, typically on a smaller scale; an example to be imitated.",
        "example": "He built a model airplane. / She is a role model."
    },
    {
        "word": "modern",
        "definition": "Relating to the present or recent times as opposed to the remote past.",
        "example": "They live in a modern apartment."
    },
    {
        "word": "moment",
        "definition": "A very brief period of time.",
        "example": "I’ll be ready in a moment."
    },
    {
        "word": "money",
        "definition": "A current medium of exchange in the form of coins and banknotes.",
        "example": "I need to withdraw some money."
    },
    {
        "word": "month",
        "definition": "A period of about four weeks, or 30 days.",
        "example": "There are twelve months in a year."
    },
    {
        "word": "more",
        "definition": "A greater amount or number of.",
        "example": "I need more time."
    },
    {
        "word": "morning",
        "definition": "The period of time between midnight and noon or between sunrise and noon.",
        "example": "I wake up early in the morning."
    },
    {
        "word": "most",
        "definition": "The greatest amount, extent, or number.",
        "example": "Most people like pizza."
    },
    {
        "word": "mother",
        "definition": "A female parent.",
        "example": "My mother is a teacher."
    },
    {
        "word": "mouth",
        "definition": "The opening in the lower part of the human face, surrounded by the lips, through which food is taken in and sounds are uttered.",
        "example": "Close your mouth when you eat."
    },
    {
        "word": "move",
        "definition": "To change position; to change one’s place of residence.",
        "example": "Please don’t move. / They decided to move to another city."
    },
    {
        "word": "movement",
        "definition": "An act of changing physical location or position; a group of people working together to advance a shared idea or cause.",
        "example": "He made a sudden movement. / The civil rights movement was important."
    },
    {
        "word": "movie",
        "definition": "A story or event recorded by a camera as a set of moving images and shown in a cinema or on television; a film.",
        "example": "We watched a funny movie."
    },
    {
        "word": "Mr",
        "definition": "A title used before a surname or full name of a married or unmarried man.",
        "example": "Mr. Smith is my teacher."
    },
    {
        "word": "Mrs",
        "definition": "A title used before the surname of a married woman.",
        "example": "Mrs. Jones lives next door."
    },
    {
        "word": "much",
        "definition": "A large amount of; to a great extent.",
        "example": "There isn’t much sugar left. / Thank you very much."
    },
    {
        "word": "music",
        "definition": "Vocal or instrumental sounds combined in such a way as to produce beauty of form, harmony, and expression of emotion. 3",
        "example": "I enjoy listening to music."
    },
    {
        "word": "must",
        "definition": "Used to indicate a necessity or requirement; used to indicate that something is highly likely.",
        "example": "You must finish your work. / He must be tired."
    },
    {
        "word": "my",
        "definition": "Belonging to or associated with the speaker.",
        "example": "This is my book."
    },
    {
        "word": "myself",
        "definition": "Used as a reflexive pronoun; used for emphasis.",
        "example": "I cooked dinner for myself. / I did it myself."
    },
    {
        "word": "name",
        "definition": "A word or term used to identify someone or something.",
        "example": "What is your name?"
    },
    {
        "word": "nation",
        "definition": "A large body of people united by common descent, history, culture, or language, inhabiting a particular country or territory. 4",
        "example": "The United Nations is an organization of nations."
    },
    {
        "word": "national",
        "definition": "Relating to or characteristic of a nation; common to a whole nation.",
        "example": "It’s a national holiday."
    },
    {
        "word": "natural",
        "definition": "Existing in or derived from nature; not made or caused by humankind.",
        "example": "It was a natural disaster."
    },
    {
        "word": "nature",
        "definition": "The phenomena of the physical world collectively, including plants, animals, the landscape, and other features and products of the earth, as opposed to humans or human creations. 5",
        "example": "They enjoyed the beauty of nature."
    },
    {
        "word": "near",
        "definition": "At or to a short distance away from; close to.",
        "example": "The park is near my house."
    },
    {
        "word": "nearly",
        "definition": "Almost; very close to.",
        "example": "It’s nearly finished."
    },
    {
        "word": "necessary",
        "definition": "Required to be done, achieved, or present; essential.",
        "example": "It is necessary to wear a helmet."
    },
    {
        "word": "need",
        "definition": "Require (something) because it is essential or very important.",
        "example": "I need your help."
    },
    {
        "word": "network",
        "definition": "An arrangement of intersecting horizontal and vertical lines; a group of interconnected people or things.",
        "example": "The town has a complex road network. / He has a large professional network."
    },
    {
        "word": "never",
        "definition": "At no time in the past or future.",
        "example": "I have never been to Japan."
    },
    {
        "word": "new",
        "definition": "Not existing before; recently made, built, or discovered.",
        "example": "They bought a new car."
    },
    {
        "word": "news",
        "definition": "Newly received or noteworthy information about recent events.",
        "example": "What’s the latest news?"
    },
    {
        "word": "newspaper",
        "definition": "A printed publication (usually issued daily or weekly) consisting of folded unstapled sheets and containing news, articles, advertisements, and correspondence. 6",
        "example": "I read the newspaper every morning."
    },
    {
        "word": "next",
        "definition": "Immediately following in time, order, or space.",
        "example": "What are you doing next week?"
    },
    {
        "word": "nice",
        "definition": "Pleasant; agreeable; good-natured.",
        "example": "It was a nice day. / She is a very nice person."
    },
    {
        "word": "night",
        "definition": "The period from sunset to sunrise in each twenty-four hours.",
        "example": "It was a dark night."
    },
    {
        "word": "no",
        "definition": "Used to give a negative response; not any.",
        "example": "No, I cannot come. / There is no milk left."
    },
    {
        "word": "none",
        "definition": "Not any.",
        "example": "None of the students failed."
    },
    {
        "word": "nor",
        "definition": "Used before the second or more of a set of things that are not true or do not happen.",
        "example": "He is neither tall nor short."
    },
    {
        "word": "north",
        "definition": "The direction towards the point of the horizon where the sun is at noon in the southern hemisphere.",
        "example": "The city is to the north."
    },
    {
        "word": "not",
        "definition": "Used to make a statement negative.",
        "example": "I am not ready."
    },
    {
        "word": "note",
        "definition": "A brief record of points or ideas written down as an aid to memory; a single tone in music.",
        "example": "He took notes during the lecture. / She sang a high note."
    },
    {
        "word": "nothing",
        "definition": "Not anything; no amount.",
        "example": "There is nothing in the box."
    },
    {
        "word": "notice",
        "definition": "The fact of observing or paying attention to something; a public announcement.",
        "example": "Did you notice his new haircut? / There was a notice on the board."
    },
    {
        "word": "now",
        "definition": "At the present time.",
        "example": "I need to leave now."
    },
    {
        "word": "n’t",
        "definition": "Contraction of not.",
        "example": "I can’t believe it."
    },
    {
        "word": "number",
        "definition": "An arithmetical value; a quantity.",
        "example": "What is your phone number? / A large number of people attended."
    },
    {
        "word": "occur",
        "definition": "To happen; to exist or be found in a particular place or position.",
        "example": "The accident occurred yesterday. / Diamonds occur naturally."
    },
    {
        "word": "of",
        "definition": "Expressing the relationship between a part and a whole; belonging to.",
        "example": "A piece of cake. / The capital of France."
    },
    {
        "word": "off",
        "definition": "Away from; not operating or in existence.",
        "example": "Turn off the light. / The power is off."
    },
    {
        "word": "offer",
        "definition": "To present something for someone to accept or reject; a proposal.",
        "example": "He offered me a job. / They made a good offer."
    },
    {
        "word": "office",
        "definition": "A room, set of rooms, or building used as a place for commercial, professional, or bureaucratic work.",
        "example": "I work in an office in the city."
    },
    {
        "word": "officer",
        "definition": "A person holding a position of authority, especially in the armed forces or a government department.",
        "example": "A police officer arrived at the scene."
    },
    {
        "word": "official",
        "definition": "Relating to an authority or public body and its activities and responsibilities; a person holding public office.",
        "example": "This is the official document. / He is a government official."
    },
    {
        "word": "often",
        "definition": "Frequently; many times.",
        "example": "I often go for a walk in the park."
    },
    {
        "word": "oh",
        "definition": "Used to express surprise, pain, or a variety of other emotions.",
        "example": "Oh, I didn’t know that!"
    },
    {
        "word": "oil",
        "definition": "A viscous liquid derived from petroleum; any of various other viscous liquids.",
        "example": "They discovered a large oil field. / Use olive oil in the salad."
    },
    {
        "word": "ok",
        "definition": "All right; acceptable.",
        "example": "That’s ok with me."
    },
    {
        "word": "old",
        "definition": "Having lived for a long time; of a specified age; no longer new.",
        "example": "My grandfather is very old. / This is an old building."
    },
    {
        "word": "on",
        "definition": "Physically in contact with and supported by; indicating position on a road or area.",
        "example": "The book is on the table. / They live on Elm Street."
    },
    {
        "word": "once",
        "definition": "On one occasion only; formerly.",
        "example": "I met him once. / He was once a teacher."
    },
    {
        "word": "one",
        "definition": "The lowest cardinal number; a single person or thing.",
        "example": "I have one apple. / One of the students was late."
    },
    {
        "word": "only",
        "definition": "And no one or nothing more besides; solely or exclusively.",
        "example": "I only have five dollars. / He is the only child."
    },
    {
        "word": "onto",
        "definition": "Moving to a position on the surface of something.",
        "example": "The cat jumped onto the table."
    },
    {
        "word": "open",
        "definition": "Allowing access, passage, or view through an empty space; not closed.",
        "example": "The door is open."
    },
    {
        "word": "operation",
        "definition": "The action of functioning or being active; a process; a surgical procedure.",
        "example": "The machine is in operation. / He had a complex operation."
    },
    {
        "word": "opportunity",
        "definition": "A set of circumstances that makes it possible to do something.",
        "example": "This is a great opportunity."
    },
    {
        "word": "option",
        "definition": "A choice or possibility.",
        "example": "You have two options."
    },
    {
        "word": "or",
        "definition": "Used to link alternatives.",
        "example": "Do you want tea or coffee?"
    },
    {
        "word": "order",
        "definition": "The arrangement of things in relation to each other; a command.",
        "example": "Put the books in alphabetical order. / The police gave an order."
    },
    {
        "word": "organization",
        "definition": "An organized body of people with a particular purpose.",
        "example": "She works for a non-profit organization."
    },
    {
        "word": "other",
        "definition": "Used to refer to a person or thing that is different from one already mentioned or known about.",
        "example": "Are there any other questions?"
    },
    {
        "word": "others",
        "definition": "Other people or things.",
        "example": "He is different from the others."
    },
    {
        "word": "our",
        "definition": "Belonging to or associated with the speaker and one or more other people previously mentioned or easily identified.",
        "example": "This is our house."
    },
    {
        "word": "out",
        "definition": "Moving or extending away from the interior of something; away from home.",
        "example": "He went outside. / She is out of town."
    },
    {
        "word": "outside",
        "definition": "The external side or surface of something; not within a building.",
        "example": "The outside of the box is red. / Let’s eat outside."
    },
    {
        "word": "over",
        "definition": "Extending directly upward from; across the top of.",
        "example": "The plane flew over the city."
    },
    {
        "word": "own",
        "definition": "Used to emphasize that someone or something belongs to a particular person or thing.",
        "example": "I have my own room."
    },
    {
        "word": "owner",
        "definition": "A person who owns something.",
        "example": "He is the owner of the dog."
    },
    {
        "word": "page",
        "definition": "One side of a sheet of paper in a book, magazine, newspaper, etc.",
        "example": "Read page 10."
    },
    {
        "word": "pain",
        "definition": "Highly unpleasant physical sensation caused by illness or injury; mental suffering.",
        "example": "He felt a sharp pain in his leg. / The news caused her great pain."
    },
    {
        "word": "painting",
        "definition": "A picture or design executed in paint; the action or skill of using paint.",
        "example": "They bought a beautiful painting. / She enjoys painting."
    },
    {
        "word": "paper",
        "definition": "Material manufactured in thin sheets from the pulp of wood or other fibrous substances.",
        "example": "I need a piece of paper."
    },
    {
        "word": "parent",
        "definition": "A mother or father.",
        "example": "My parents are coming to visit."
    },
    {
        "word": "part",
        "definition": "A piece or segment of something; a role in a play or movie.",
        "example": "This is a part of the plan. / He played the main part in the play."
    },
    {
        "word": "participant",
        "definition": "A person who takes part in something.",
        "example": "There were many participants in the race."
    },
    {
        "word": "particular",
        "definition": "Referring to an individual member of a group or class; specific.",
        "example": "Is there any particular reason?"
    },
    {
        "word": "particularly",
        "definition": "Especially; more than usual.",
        "example": "It was particularly cold today."
    },
    {
        "word": "partner",
        "definition": "A person who takes part in an undertaking with another or others, especially in a business or firm; a person’s spouse or romantic partner.",
        "example": "He is my business partner. / She introduced her partner."
    },
    {
        "word": "party",
        "definition": "A social gathering for celebration or entertainment; a political group.",
        "example": "We are having a party on Saturday. / He is a member of the political party."
    },
    {
        "word": "pass",
        "definition": "To move or cause to move in a specified direction; a successful completion of an examination or course.",
        "example": "The car passed us quickly. / He passed the exam."
    },
    {
        "word": "past",
        "definition": "Gone by in time and no longer existing; a former time.",
        "example": "That was in the past. / The past is history."
    },
    {
        "word": "patient",
        "definition": "Able to accept or tolerate delays, problems, or suffering without becoming annoyed or anxious; a person receiving medical treatment. 7",
        "example": "You need to be patient. / The patient is recovering well."
    },
    {
        "word": "pattern",
        "definition": "A repeated decorative design; a regular or comprehensible form or sequence.",
        "example": "The wallpaper has a floral pattern. / We noticed a pattern in the data."
    },
    {
        "word": "pay",
        "definition": "To give someone money that they have earned; to give money for something.",
        "example": "The company will pay you monthly. / You need to pay the bill."
    },
    {
        "word": "peace",
        "definition": "Freedom from disturbance; a period of time when there is no war or fighting.",
        "example": "They are working for peace in the region."
    },
    {
        "word": "people",
        "definition": "Human beings in general or considered collectively.",
        "example": "A lot of people were at the event."
    },
    {
        "word": "per",
        "definition": "For each.",
        "example": "The speed limit is 50 miles per hour."
    },
    {
        "word": "perform",
        "definition": "To carry out, accomplish, or fulfill (a task, action, or function); to present entertainment to an audience.",
        "example": "He needs to perform his duties. / The band will perform tonight."
    },
    {
        "word": "performance",
        "definition": "An act of presenting a play, concert, or other form of entertainment; the action or process of performing a task or function. 8",
        "example": "The concert performance was excellent. / The car’s performance is good."
    },
    {
        "word": "perhaps",
        "definition": "Perhaps; possibly.",
        "example": "Perhaps we should try again."
    },
    {
        "word": "period",
        "definition": "A length of time.",
        "example": "It was a difficult period."
    },
    {
        "word": "person",
        "definition": "A human being regarded as an individual.",
        "example": "There is one person waiting."
    },
    {
        "word": "personal",
        "definition": "Of, concerning, or affecting an individual person or their private life and relationships.",
        "example": "This is my personal opinion."
    },
    {
        "word": "phone",
        "definition": "A telephone.",
        "example": "I’ll call you on the phone."
    },
    {
        "word": "physical",
        "definition": "Relating to the body as opposed to the mind; relating to things that are tangible.",
        "example": "He is in good physical condition. / The physical world is real."
    },
    {
        "word": "pick",
        "definition": "To select from a number of alternatives; to choose.",
        "example": "Pick the best option."
    },
    {
        "word": "picture",
        "definition": "A painting, drawing, or photograph; a visual representation.",
        "example": "She drew a beautiful picture."
    },
    {
        "word": "piece",
        "definition": "A portion of an object, material, or abstract entity, taken or isolated from a whole.",
        "example": "He ate a piece of cake."
    },
    {
        "word": "place",
        "definition": "A particular position, point, or area in space; a location.",
        "example": "This is my favorite place."
    },
    {
        "word": "plan",
        "definition": "A detailed proposal for doing or achieving something; to decide on and make arrangements for.",
        "example": "We need a plan. / We should plan our trip."
    },
    {
        "word": "plant",
        "definition": "A living organism of the kind exemplified by trees, shrubs, herbs, grasses, ferns, and mosses, typically growing in a permanent 9 site.",
        "example": "She is watering the plants."
    },
    {
        "word": "play",
        "definition": "Engage in activity for enjoyment and recreation; a dramatic work.",
        "example": "Children love to play. / We watched a play at the theater."
    },
    {
        "word": "player",
        "definition": "A person taking part in a sport or game.",
        "example": "He is a professional football player."
    },
    {
        "word": "PM",
        "definition": "Post Meridiem (after noon); Prime Minister (in some countries).",
        "example": "The meeting is at 3 PM. / The PM gave a speech."
    },
    {
        "word": "point",
        "definition": "A particular spot, place, or position; a specific detail or idea.",
        "example": "He pointed to a spot on the map. / That’s a valid point."
    },
    {
        "word": "police",
        "definition": "The civil force of a state, responsible for the prevention and detection of crime and the maintenance of public order. 10",
        "example": "The police arrived at the scene."
    },
    {
        "word": "policy",
        "definition": "A course or principle of action adopted or proposed by a government, party, business, or individual.",
        "example": "The company has a strict attendance policy."
    },
    {
        "word": "political",
        "definition": "Relating to the government or public affairs of a country.",
        "example": "They discussed political issues."
    },
    {
        "word": "politics",
        "definition": "The activities associated with the governance of a country or area.",
        "example": "He is interested in politics."
    },
    {
        "word": "poor",
        "definition": "Having little or no money, goods, or other means of support; of a low standard.",
        "example": "The poor family struggled to survive. / The food quality was poor."
    },
    {
        "word": "popular",
        "definition": "Liked, enjoyed, or supported by many people.",
        "example": "Football is a very popular sport."
    },
    {
        "word": "population",
        "definition": "All the inhabitants of a particular town, area, or country.",
        "example": "The population of the city is growing."
    },
    {
        "word": "position",
        "definition": "A place where someone or something is located or has been put; a job or role.",
        "example": "His position on the map is here. / She applied for a new position."
    },
    {
        "word": "positive",
        "definition": "Consisting in or characterized by the presence rather than the absence of distinguishing features; constructive 11 or optimistic.",
        "example": "He received a positive test result. / She has a positive attitude."
    },
    {
        "word": "possible",
        "definition": "Able to be done; capable of happening or existing.",
        "example": "Is it possible to finish this today?"
    },
    {
        "word": "power",
        "definition": "The ability or capacity to do something or act in a particular way; physical strength and force exerted by something or someone. 12",
        "example": "He has the power to make decisions. / The storm had immense power."
    },
    {
        "word": "practice",
        "definition": "The actual application or use of an idea, belief, or method, as opposed to theories relating to it; repeated exercise in or performance of an activity or skill so as to acquire or maintain proficiency in it. 13",
        "example": "It’s good to put theory into practice. / You need to practice every day."
    },
    {
        "word": "prepare",
        "definition": "To make something ready for use or consideration.",
        "example": "We need to prepare for the exam."
    },
    {
        "word": "present",
        "definition": "In a particular place; existing or occurring now; a gift.",
        "example": "He was present at the meeting. / The present time is difficult. / She received a birthday present."
    },
    {
        "word": "president",
        "definition": "The elected head of a republican state.",
        "example": "The president gave a speech."
    },
    {
        "word": "pressure",
        "definition": "The use of persuasion, influence, or intimidation to make someone do something; physical force exerted on an object.",
        "example": "He felt under a lot of pressure. / The water pressure is low."
    },
    {
        "word": "pretty",
        "definition": "Attractive in a delicate way; to some extent but not completely.",
        "example": "She is a pretty girl. / It’s pretty cold outside."
    },
    {
        "word": "prevent",
        "definition": "To keep something from happening or arising; to make (someone) unable to do something.",
        "example": "We need to prevent the spread of the virus."
    },
    {
        "word": "price",
        "definition": "The amount of money expected, required, or given in payment for something.",
        "example": "What is the price of this shirt?"
    },
    {
        "word": "private",
        "definition": "For use by only one person or group; belonging to or for the use of one particular person or group.",
        "example": "This is a private conversation. / He attended a private school."
    },
    {
        "word": "probably",
        "definition": "Most likely.",
        "example": "It will probably rain tomorrow."
    },
    {
        "word": "problem",
        "definition": "A matter or situation regarded as unwelcome or harmful and needing to be dealt with and overcome.",
        "example": "We have a serious problem."
    },
    {
        "word": "process",
        "definition": "A series of actions or steps taken in order to achieve a particular end; to perform a series of mechanical or chemical operations on something.",
        "example": "It’s 14 a long process. / The factory processes raw materials."
    },
    {
        "word": "produce",
        "definition": "To make or manufacture from components or raw materials; fresh fruits and vegetables.",
        "example": "The factory produces cars. / We bought fresh produce at the market."
    },
    {
        "word": "product",
        "definition": "An article or substance that is manufactured or refined for sale; the result of a process or growth.",
        "example": "This is a new product. / Their collaboration was the product of years of effort."
    },
    {
        "word": "production",
        "definition": "The action of manufacturing something from components or raw materials; the process of creating something.",
        "example": "Car production is increasing. / The production of the play was excellent."
    },
    {
        "word": "professional",
        "definition": "Relating to or belonging to a profession; a person engaged in a specified activity as their main paid occupation.",
        "example": "She is a professional photographer. / He is a true professional."
    },
    {
        "word": "professor",
        "definition": "A teacher of the highest rank in a university or college.",
        "example": "My history professor is very knowledgeable."
    },
    {
        "word": "program",
        "definition": "A planned series of future events; a set of instructions enabling a computer to perform a task.",
        "example": "We have a busy program today. / He wrote a computer program."
    },
    {
        "word": "project",
        "definition": "An individual or collaborative enterprise that is carefully planned to achieve a particular aim; to forecast or estimate something on the basis of present trends.",
        "example": "They are working on a new project. / Sales are projected to increase."
    },
    {
        "word": "property",
        "definition": "A thing or things belonging to someone; an area of land.",
        "example": "He owns a lot of property. / They bought a new property."
    },
    {
        "word": "protect",
        "definition": "To keep safe from harm or injury.",
        "example": "We need to protect the environment."
    },
    {
        "word": "prove",
        "definition": "To demonstrate the truth or existence of something by evidence; to show to be.",
        "example": "Can you prove it? / The experiment proved the theory."
    },
    {
        "word": "provide",
        "definition": "To make available for use; to supply.",
        "example": "They provide excellent service."
    },
    {
        "word": "public",
        "definition": "Of or concerning the people as a whole; a place or area that is open to everyone.",
        "example": "It is a public holiday. / The park is open to the public."
    },
    {
        "word": "pull",
        "definition": "To grasp and draw something toward oneself.",
        "example": "Pull the door open."
    },
    {
        "word": "purpose",
        "definition": "The reason for which something is done or created or for which something exists.",
        "example": "What is the purpose of this meeting?"
    },
    {
        "word": "push",
        "definition": "To exert force on (someone or something) in order to move them away from oneself.",
        "example": "Push the door open."
    },
    {
        "word": "put",
        "definition": "To move to or place in a particular position; to express in a particular way.",
        "example": "Put the book on the table. / He put his idea forward."
    },
    {
        "word": "quality",
        "definition": "The standard of something as measured against other things of a similar kind; the degree of excellence of something. 15",
        "example": "The quality of the product is very good."
    },
    {
        "word": "question",
        "definition": "A sentence worded or expressed so as to elicit information; a doubt about the truth or validity of something.",
        "example": "Can I ask a question? / There is no question about it."
    },
    {
        "word": "quickly",
        "definition": "At a fast speed; rapidly.",
        "example": "He walked quickly."
    },
    {
        "word": "quite",
        "definition": "To a certain or considerable extent; rather.",
        "example": "It’s quite cold outside."
    },
    {
        "word": "race",
        "definition": "A competition in which all the competitors try to be the fastest; a group of people sharing certain inherited physical characteristics.",
        "example": "He won the race. / Discussions on race relations are important."
    },
    {
        "word": "radio",
        "definition": "The transmission and reception of electromagnetic waves of radio frequency, especially used for broadcasting.",
        "example": "I listened to the radio this morning."
    },
    {
        "word": "raise",
        "definition": "To lift or move to a higher position; to increase the level of something.",
        "example": "Raise your hand if you know the answer. / They will raise prices."
    },
    {
        "word": "range",
        "definition": "A set of different things of the same general type; the area covered by something.",
        "example": "The store has a wide range of products. / The mountain range is beautiful."
    },
    {
        "word": "rate",
        "definition": "A measure, quantity, or frequency, typically one measured against another quantity or measure; a charge or payment fixed according to a standard scale.",
        "example": "The unemployment rate is high. / What is the hourly rate?"
    },
    {
        "word": "rather",
        "definition": "To a certain extent; slightly; preferably.",
        "example": "It’s rather difficult. / I’d rather stay home."
    },
    {
        "word": "reach",
        "definition": "To stretch out an arm in a specified direction in order to touch or grasp something; to arrive at.",
        "example": "Can you reach the top shelf? / We will reach the destination soon."
    },
    {
        "word": "read",
        "definition": "To look at a series of written symbols and get meaning from them.",
        "example": "I like to read books."
    },
    {
        "word": "ready",
        "definition": "In a suitable state for an activity or purpose; prepared.",
        "example": "Are you ready to go?"
    },
    {
        "word": "real",
        "definition": "Actually existing as a thing or occurring in fact; not imagined or supposed.",
        "example": "This is a real problem."
    },
    {
        "word": "reality",
        "definition": "The state of things as they actually exist, as opposed to an idealistic or notional idea of what is possible.",
        "example": "He needs to face reality."
    },
    {
        "word": "realize",
        "definition": "To become fully aware of something as a fact; to understand clearly.",
        "example": "I didn’t realize how late it was."
    },
    {
        "word": "really",
        "definition": "In a way that is appropriate or suitable; very.",
        "example": "I am really tired."
    },
    {
        "word": "reason",
        "definition": "A cause, explanation, or justification for an action or event.",
        "example": "What is the reason for this?"
    },
    {
        "word": "receive",
        "definition": "To be given, presented with, or paid (something); to get.",
        "example": "I received a gift."
    },
    {
        "word": "recent",
        "definition": "Having happened, been made, or done not long ago.",
        "example": "This is a recent photograph."
    },
    {
        "word": "recently",
        "definition": "Not long ago; in the near past.",
        "example": "I haven’t seen her recently."
    },
    {
        "word": "recognize",
        "definition": "To identify someone or something from having encountered them before; to acknowledge.",
        "example": "I didn’t recognize him. / They recognize his authority."
    },
    {
        "word": "record",
        "definition": "A piece of evidence about the past; the best official performance ever achieved in a sport or other competitive activity; to set down in writing or other permanent form for later reference.",
        "example": "Keep a record of your expenses. / He broke the world record. / Please record the meeting."
    },
    {
        "word": "red",
        "definition": "Of the color at the end of the spectrum next to orange and opposite violet.",
        "example": "She wore a red dress."
    },
    {
        "word": "reduce",
        "definition": "To make or become smaller or less in amount, degree, or size.",
        "example": "We need to reduce waste."
    },
    {
        "word": "reflect",
        "definition": "To throw back (light, heat, or sound) without absorbing it; to think deeply or carefully about.",
        "example": "The mirror reflected the light. / He reflected on his past."
    },
    {
        "word": "region",
        "definition": "An area or division, especially part of a country or the world having definable characteristics but not always fixed 16 boundaries.",
        "example": "This is an agricultural region."
    },
    {
        "word": "relate",
        "definition": "To make or show a connection between; to connect or be concerned with.",
        "example": "Can you relate the story? / The findings relate to our research."
    },
    {
        "word": "relationship",
        "definition": "The way in which two or more concepts, objects, or people are connected; the state of being connected.",
        "example": "They have a close relationship."
    },
    {
        "word": "religious",
        "definition": "Relating to or believing in a religion.",
        "example": "They attend a religious service."
    },
    {
        "word": "remain",
        "definition": "To continue to be in the same state; to stay.",
        "example": "Please remain seated. / He remained calm."
    },
    {
        "word": "remember",
        "definition": "To recall from one’s memory; to not forget.",
        "example": "I can’t remember his name."
    },
    {
        "word": "remove",
        "definition": "To take away or off from the position occupied.",
        "example": "Please remove your shoes."
    },
    {
        "word": "report",
        "definition": "A written or spoken account of something that one has observed, heard, done, or investigated; to give a spoken or written account of.",
        "example": "He wrote a report on the project. / Please report any issues."
    },
    {
        "word": "represent",
        "definition": "To be entitled or appointed to act or speak for (someone); to stand for or in place of.",
        "example": "She will represent the company. / The symbol represents peace."
    },
    {
        "word": "Republican",
        "definition": "A member of the Republican Party (especially in the US).",
        "example": "He is a registered Republican."
    },
    {
        "word": "require",
        "definition": "To need for a particular purpose; to depend on.",
        "example": "This task will require a lot of effort."
    },
    {
        "word": "research",
        "definition": "The systematic investigation into and study of materials and sources in order to establish facts and reach new 17 conclusions; to investigate systematically. 18",
        "example": "They are doing research on cancer. / She is researching the topic."
    },
    {
        "word": "resource",
        "definition": "A source of supply, support, or aid, especially one that can be drawn upon when needed.",
        "example": "Oil is a natural resource. / We need more financial resources."
    },
    {
        "word": "respond",
        "definition": "To say something in reply; to react quickly or positively to something.",
        "example": "He responded to the email. / The patient did not respond to the treatment."
    },
    {
        "word": "response",
        "definition": "A verbal or written answer; a reaction to something.",
        "example": "I did not receive a response. / Her response was positive."
    },
    {
        "word": "responsibility",
        "definition": "The state or fact of having a duty to deal with something or of having control over someone.",
        "example": "It is your responsibility to finish the work."
    },
    {
        "word": "rest",
        "definition": "To cease work or movement in order to relax, sleep, or recover strength; the remaining part.",
        "example": "Take a rest. / Eat the rest of the cake."
    },
    {
        "word": "result",
        "definition": "A consequence, effect, or outcome of something.",
        "example": "The results of the exam were good."
    },
    {
        "word": "return",
        "definition": "To come or go back to a place; the act of coming or going back.",
        "example": "When will you return? / We are awaiting his return."
    },
    {
        "word": "reveal",
        "definition": "To make known (something previously secret or unknown).",
        "example": "He refused to reveal his source."
    },
    {
        "word": "rich",
        "definition": "Having a great deal of money or assets; abundant in a particular desirable thing.",
        "example": "He is a rich man. / The soil is rich in minerals."
    },
    {
        "word": "right",
        "definition": "Morally good, justified, or acceptable; on the side of the body to the east when one is facing north; something to which a person is legally or morally entitled.",
        "example": "That was the right decision. / Turn right at the corner. / Everyone has the right to education."
    },
    {
        "word": "rise",
        "definition": "To move from a lower position to a higher one; an increase.",
        "example": "The sun will rise soon. / There was a rise in temperature."
    },
    {
        "word": "risk",
        "definition": "A situation involving exposure to danger.",
        "example": "It’s a high risk investment."
    },
    {
        "word": "road",
        "definition": "A wide way leading from one place to another, especially one with a specially prepared surface which vehicles can use. 19",
        "example": "The road was blocked."
    },
    {
        "word": "rock",
        "definition": "A large piece of stone; a type of popular music.",
        "example": "The climber stood on a rock. / He likes listening to rock music."
    },
    {
        "word": "role",
        "definition": "An actor’s part in a play or film; the function assumed or part played by a person or thing in a particular situation.",
        "example": "She played the main role. / What is your role in the project?"
    },
    {
        "word": "room",
        "definition": "Space that can be occupied or where something can be done; a part of a building enclosed by walls, floor, and ceiling.",
        "example": "Is there enough room for everyone? / I cleaned my room."
    },
    {
        "word": "rule",
        "definition": "One of a set of explicit or understood regulations or principles governing conduct within a particular activity or sphere; 20 to exercise ultimate power or authority over.",
        "example": "You must follow the rules. / The king ruled the country."
    },
    {
        "word": "run",
        "definition": "To move rapidly on foot; to operate or control.",
        "example": "He can run very fast. / Who runs this business?"
    },
    {
        "word": "safe",
        "definition": "Protected from or not exposed to danger or risk; not likely to cause or incur danger or harm.",
        "example": "Keep your valuables in a safe place."
    },
    {
        "word": "same",
        "definition": "Identical; not different; used to refer to a person or thing previously mentioned.",
        "example": "We ordered the same dish. / I feel the same way."
    },
    {
        "word": "save",
        "definition": "To keep safe or rescue from harm; to store up (money or goods).",
        "example": "He tried to save the drowning child. / I’m saveing for a new car."
    },
    {
        "word": "say",
        "definition": "To utter words so as to convey information, an opinion, or a feeling.",
        "example": "What did he say?"
    },
    {
        "word": "scene",
        "definition": "The place where an incident in real life or fiction occurs; a part of a play or movie.",
        "example": "The police arrived at the scene of the accident. / It was a dramatic scene."
    },
    {
        "word": "school",
        "definition": "An institution for educating children; a department of a university.",
        "example": "My children go to school. / He is studying in the law school."
    },
    {
        "word": "science",
        "definition": "The intellectual and practical activity encompassing the systematic study of the structure and behaviour of the physical and natural world through observation and experiment.",
        "example": "She is studying science."
    },
    {
        "word": "scientist",
        "definition": "A person who is studying or has studied science and works in it.",
        "example": "A scientist made a new discovery."
    },
    {
        "word": "score",
        "definition": "The number of points, goals, runs, etc. achieved in a game or contest; to gain a point, goal, etc.",
        "example": "What is the final score? / He scored a goal."
    },
    {
        "word": "sea",
        "definition": "The expanse of salt water that covers most of the earth’s surface.",
        "example": "We went for a swim in the sea."
    },
    {
        "word": "season",
        "definition": "Each of the four divisions of the year (spring, summer, autumn, and winter); a period of the year characterized by particular conditions or activities.",
        "example": "My favorite season is autumn. / The football season starts next month."
    },
    {
        "word": "seat",
        "definition": "A thing made or used for sitting on; a place as a member of an elected body.",
        "example": "Take a seat. / She won a seat in the parliament."
    },
    {
        "word": "second",
        "definition": "Constituting number two in a sequence; a unit of time equal to 1/60th of a minute.",
        "example": "This is the second chapter. / Wait a second!"
    },
    {
        "word": "section",
        "definition": "Any of the more or less distinct parts into which something is or may be divided.",
        "example": "Read section three of the book."
    },
    {
        "word": "security",
        "definition": "The state of being free from danger or threat; measures taken to prevent crime.",
        "example": "Airport security is very strict."
    },
    {
        "word": "see",
        "definition": "To perceive with the eyes; to understand.",
        "example": "Can you see that bird? / I see what you mean."
    },
    {
        "word": "seek",
        "definition": "To attempt to find something; to try to obtain or achieve.",
        "example": "They are seeking refuge. / He seeks advice from his mentor."
    },
    {
        "word": "seem",
        "definition": "To give the impression of being something or having a particular quality; appear.",
        "example": "She seems tired."
    },
    {
        "word": "sell",
        "definition": "To exchange something for money; to persuade someone to buy something.",
        "example": "They sell fresh fruit here. / He tried to sell me a new car."
    },
    {
        "word": "send",
        "definition": "To cause to go or be taken to a destination; to transmit.",
        "example": "Please send me an email."
    },
    {
        "word": "senior",
        "definition": "Of or for people who are older or elderly; having a higher level of rank or status.",
        "example": "He is a senior citizen. / She is a senior manager."
    },
    {
        "word": "sense",
        "definition": "A faculty by which the body perceives an external stimulus; a feeling that something is the case.",
        "example": "The five senses are sight, hearing, smell, taste, and touch. / I have a sense that something is wrong."
    },
    {
        "word": "series",
        "definition": "A set of related things of the same kind, following each other in time.",
        "example": "We watched a TV series."
    },
    {
        "word": "serious",
        "definition": "Demanding or resulting from careful consideration or application; not trivial or humorous.",
        "example": "It is a serious matter."
    },
    {
        "word": "serve",
        "definition": "To perform duties or services for an organization or person; to provide food or drink.",
        "example": "He served in the army. / They serve excellent food."
    },
    {
        "word": "service",
        "definition": "The action of helping or doing work for someone; a system supplying a public need.",
        "example": "The customer service was excellent. / Public transport services are important."
    },
    {
        "word": "set",
        "definition": "A group of things with common features; to put, lay, or stand something in a particular place.",
        "example": "A set of keys. / Please set the table."
    },
    {
        "word": "seven",
        "definition": "The number equivalent to the sum of three and four; one more than six.",
        "example": "There are seven days in a week."
    },
    {
        "word": "several",
        "definition": "More than two but not many.",
        "example": "I have several questions."
    },
    {
        "word": "sex",
        "definition": "Either of the two main categories (male and female) into which humans and many other living things are divided on the basis of their reproductive functions. 1",
        "example": "What is your sex?"
    },
    {
        "word": "sexual",
        "definition": "Relating to the instinct or physical processes connected with physical attraction or reproductive behavior.",
        "example": "They discussed sexual health."
    },
    {
        "word": "shake",
        "definition": "To move rapidly and irregularly to and fro; to tremble.",
        "example": "Shake the bottle well. / His hands were shakeing."
    },
    {
        "word": "share",
        "definition": "A part or portion of a larger amount which is divided among a number of people; to have or use something at the same time as someone else.",
        "example": "She took her share of the cake. / Can we share this pizza?"
    },
    {
        "word": "she",
        "definition": "Used to refer to a female person or animal previously mentioned or easily identified.",
        "example": "She is my sister."
    },
    {
        "word": "shoot",
        "definition": "To fire a gun or other weapon; to kill or wound with a bullet or other projectile.",
        "example": "They went out to shoot birds."
    },
    {
        "word": "short",
        "definition": "Of small length; not tall; lasting for a small amount of time.",
        "example": "He has short hair. / The meeting was very short."
    },
    {
        "word": "shot",
        "definition": "The firing of a gun or other weapon; a photograph; an injection.",
        "example": "They heard a shot. / Take a shot of the landscape. / The doctor gave him a shot."
    },
    {
        "word": "should",
        "definition": "Used to indicate obligation, duty, or correctness; used to indicate probability or expectation.",
        "example": "You should study harder. / He should arrive soon."
    },
    {
        "word": "shoulder",
        "definition": "The joint connecting the arm or forelimb to the body.",
        "example": "He carried the bag on his shoulder."
    },
    {
        "word": "show",
        "definition": "To allow or cause to be seen; to present entertainment.",
        "example": "Show me your drawing. / The band will show tomorrow."
    },
    {
        "word": "side",
        "definition": "A position beside someone or something; a surface of an object.",
        "example": "Walk on this side of the road. / The box has six sides."
    },
    {
        "word": "sign",
        "definition": "An object, quality, or event whose presence or occurrence indicates the probable presence or occurrence of something else; 2 a piece of information.",
        "example": "It was a sign of trouble. / Follow the road signs."
    },
    {
        "word": "significant",
        "definition": "Sufficiently great or important to be worthy of attention; noteworthy.",
        "example": "This is a significant change."
    },
    {
        "word": "similar",
        "definition": "Resembling without being identical.",
        "example": "The two houses are very similar."
    },
    {
        "word": "simple",
        "definition": "Easily understood or done; not complicated.",
        "example": "It’s a simple question."
    },
    {
        "word": "simply",
        "definition": "In a straightforward or uncomplicated manner; just; merely.",
        "example": "Explain it simply. / He was simply the best."
    },
    {
        "word": "since",
        "definition": "In the period after a particular time in the past; because.",
        "example": "I haven’t seen him since yesterday. / Since you’re here, help me."
    },
    {
        "word": "sing",
        "definition": "To make musical sounds with the voice.",
        "example": "She loves to sing."
    },
    {
        "word": "single",
        "definition": "Only one; not married or in a relationship.",
        "example": "I saw a single bird. / She is single."
    },
    {
        "word": "sister",
        "definition": "A woman or girl in relation to other children of her parents.",
        "example": "My older sister lives in London."
    },
    {
        "word": "sit",
        "definition": "To adopt or be in a position in which one’s weight is largely supported by one’s buttocks.",
        "example": "Please sit down."
    },
    {
        "word": "site",
        "definition": "An area of ground on which a town, building, or monument is constructed; a website.",
        "example": "It’s a construction site. / Visit our site for more information."
    },
    {
        "word": "situation",
        "definition": "A set of circumstances in which one finds oneself; a state of affairs.",
        "example": "It’s a difficult situation."
    },
    {
        "word": "six",
        "definition": "The number equivalent to the sum of three and three; one more than five.",
        "example": "He is six years old."
    },
    {
        "word": "size",
        "definition": "The relative extent of something; a thing’s overall dimensions or magnitude.",
        "example": "What size is this shirt?"
    },
    {
        "word": "skill",
        "definition": "The ability to do something well; expertise.",
        "example": "He has excellent communication skills."
    },
    {
        "word": "skin",
        "definition": "The outer covering of the body.",
        "example": "She has soft skin."
    },
    {
        "word": "small",
        "definition": "Of limited size, amount, or intensity; not large.",
        "example": "We live in a small apartment."
    },
    {
        "word": "smile",
        "definition": "To form one’s features into a pleased, kind, or amused expression.",
        "example": "She gave him a smile."
    },
    {
        "word": "so",
        "definition": "To such a great extent; in the way described or indicated.",
        "example": "It was so cold. / Do it so it is correct."
    },
    {
        "word": "social",
        "definition": "Relating to society or its organization; needing companionship.",
        "example": "Humans are social animals."
    },
    {
        "word": "society",
        "definition": "The community of people living in a particular country or region and having shared customs, laws, and organizations. 3",
        "example": "He studies modern society."
    },
    {
        "word": "soldier",
        "definition": "A person who serves in an army.",
        "example": "The soldier wore a uniform."
    },
    {
        "word": "some",
        "definition": "An unspecified amount or number of; approximately.",
        "example": "I need some milk. / There are some people waiting."
    },
    {
        "word": "somebody",
        "definition": "A person unknown or unspecified.",
        "example": "Somebody left the door open."
    },
    {
        "word": "someone",
        "definition": "A person unknown or unspecified.",
        "example": "Someone is knocking at the door."
    },
    {
        "word": "something",
        "definition": "A thing that is unspecified or unknown.",
        "example": "There is something strange going on."
    },
    {
        "word": "sometimes",
        "definition": "Occasionally rather than all of the time.",
        "example": "Sometimes I like to stay home."
    },
    {
        "word": "son",
        "definition": "A boy or man in relation to his parents.",
        "example": "His son is going to college."
    },
    {
        "word": "song",
        "definition": "A short piece of music with words.",
        "example": "She sang a beautiful song."
    },
    {
        "word": "soon",
        "definition": "In or after a short time.",
        "example": "See you soon!"
    },
    {
        "word": "sort",
        "definition": "A category of things having common characteristics; to arrange.",
        "example": "What sort of music do you like? / Please sort these papers."
    },
    {
        "word": "sound",
        "definition": "Vibrations that travel through the air or another medium and can be heard; healthy or in good condition.",
        "example": "I heard a strange sound. / He is in sound financial health."
    },
    {
        "word": "source",
        "definition": "A place, person, or thing from which something originates or can be obtained.",
        "example": "What is the source of this information?"
    },
    {
        "word": "south",
        "definition": "The direction toward the point of the horizon where the sun is at noon in the northern hemisphere.",
        "example": "They traveled south."
    },
    {
        "word": "southern",
        "definition": "Situated in or facing the south.",
        "example": "He lives in southern Italy."
    },
    {
        "word": "space",
        "definition": "A continuous area or expanse which is free, available, or unoccupied; the dimensions of height, depth, and width within which all things exist and 4 move.",
        "example": "Is there enough space for everyone? / The space between the planets is vast."
    },
    {
        "word": "speak",
        "definition": "To say words in an ordinary voice; to talk.",
        "example": "Can you speak louder?"
    },
    {
        "word": "special",
        "definition": "Different from what is normal or usual; better, greater, or otherwise different from what is usual.",
        "example": "This is a special occasion."
    },
    {
        "word": "specific",
        "definition": "Clearly defined or identified.",
        "example": "Please give me specific instructions."
    },
    {
        "word": "speech",
        "definition": "The expression of or the ability to express thoughts and feelings by articulate sounds; a formal address delivered to an audience.",
        "example": "He has a clear speech. / The president gave a speech."
    },
    {
        "word": "spend",
        "definition": "To use money to buy something; to pass time in a particular way.",
        "example": "I want to spend money on a new book. / We will spend the weekend at home."
    },
    {
        "word": "sport",
        "definition": "An activity involving physical exertion and skill in which an individual or team competes against another or others for entertainment.",
        "example": "Football is a popular sport."
    },
    {
        "word": "spring",
        "definition": "The season after winter and before summer; a sudden jump.",
        "example": "Flowers bloom in spring. / He made a sudden spring."
    },
    {
        "word": "staff",
        "definition": "All the people employed by a particular organization.",
        "example": "The hospital staff were very helpful."
    },
    {
        "word": "stage",
        "definition": "A raised platform on which actors, entertainers, or speakers perform; a period or step in a process.",
        "example": "The band was on stage. / The project is in the final stage."
    },
    {
        "word": "stand",
        "definition": "To have or adopt an upright position, supported by one’s feet; a position or attitude.",
        "example": "Please stand up. / What is your stand on this issue?"
    },
    {
        "word": "standard",
        "definition": "A level of quality or attainment; something used as a measure or model.",
        "example": "They maintain a high standard. / This is the industry standard."
    },
    {
        "word": "star",
        "definition": "A large, glowing ball of gas in space; a famous person.",
        "example": "We saw a bright star in the sky. / She is a movie star."
    },
    {
        "word": "start",
        "definition": "To begin or be the beginning of; the point in time or space at which something begins.",
        "example": "Let’s start the meeting. / The start of the race was exciting."
    },
    {
        "word": "state",
        "definition": "A nation or territory considered as an organized political community under one government; the particular condition that someone or something is 5 in.",
        "example": "The United States. / What is his current state of health?"
    },
    {
        "word": "statement",
        "definition": "A clear expression of something in speech or writing.",
        "example": "He made a public statement."
    },
    {
        "word": "station",
        "definition": "A building and associated facilities from which a public transport service operates; a place where a particular activity is carried on.",
        "example": "The train left the station. / It is a police station."
    },
    {
        "word": "stay",
        "definition": "To remain in the same place or in the same condition; to reside temporarily.",
        "example": "Please stay here. / We stayed at a hotel."
    },
    {
        "word": "step",
        "definition": "An act of putting one foot in front of the other when walking; a stage in a process.",
        "example": "Take one step at a time. / This is the first step."
    },
    {
        "word": "still",
        "definition": "Not moving or making a sound; continuing to happen or exist.",
        "example": "The water was still. / He is still here."
    },
    {
        "word": "stock",
        "definition": "The goods or merchandise kept on the premises of a business or warehouse and available for sale; the shares of a company.",
        "example": "The store has a large stock of goods. / He invested in the stock market."
    },
    {
        "word": "stop",
        "definition": "To bring or come to an end; to cease to happen or do something.",
        "example": "The bus stopped. / Please stop talking."
    },
    {
        "word": "store",
        "definition": "A retail establishment selling goods to the public; to keep something for future use.",
        "example": "I need to go to the store. / You can store the data on the cloud."
    },
    {
        "word": "story",
        "definition": "An account of imaginary or real people and events told for entertainment.",
        "example": "She told me a funny story."
    },
    {
        "word": "strategy",
        "definition": "A plan of action designed to achieve a long-term or overall aim.",
        "example": "They need a new business strategy."
    },
    {
        "word": "street",
        "definition": "A public road in a city or town, typically with houses and buildings on either side.",
        "example": "We walked down the street."
    },
    {
        "word": "strong",
        "definition": "Having the power to move heavy weights or perform other physically demanding tasks; able to withstand great force or pressure. 6",
        "example": "He is a strong man. / The wind was very strong."
    },
    {
        "word": "structure",
        "definition": "The arrangement of and relations between the parts or elements of something complex; a building or other object constructed from several parts. 7",
        "example": "The structure of the molecule is complex. / They built a new structure."
    },
    {
        "word": "student",
        "definition": "A person who is studying at a school or university.",
        "example": "She is a dedicated student."
    },
    {
        "word": "study",
        "definition": "The devotion of time and attention to gaining knowledge of an academic subject; a room used for reading, writing, or studying.",
        "example": "He is doing a study on climate change. / He spent hours in his study."
    },
    {
        "word": "stuff",
        "definition": "Matter, material, or articles of a specified or indeterminate kind; things.",
        "example": "Put your stuff in the box."
    },
    {
        "word": "style",
        "definition": "A distinctive appearance, typically determined by the principles according to which something is designed; a particular procedure by which something is done. 8",
        "example": "She has a unique style. / What is your cooking style?"
    },
    {
        "word": "subject",
        "definition": "A person or thing that is being discussed, described, or dealt with; an area of knowledge studied at school or university.",
        "example": "What is the subject of the conversation? / My favorite subject is history."
    },
    {
        "word": "success",
        "definition": "The accomplishment of an aim or purpose.",
        "example": "The event was a great success."
    },
    {
        "word": "successful",
        "definition": "Accomplishing a desired aim or purpose.",
        "example": "She is a successful businesswoman."
    },
    {
        "word": "such",
        "definition": "Of the kind; to so great an extent.",
        "example": "I have never seen such a beautiful sunset. / It was such a hot day."
    },
    {
        "word": "suddenly",
        "definition": "Quickly and unexpectedly.",
        "example": "The weather changed suddenly."
    },
    {
        "word": "suffer",
        "definition": "To experience or be subjected to (unpleasant or unwelcome things); to undergo.",
        "example": "He is suffering from a cold. / The company suffered a loss."
    },
    {
        "word": "suggest",
        "definition": "To put forward for consideration; to propose.",
        "example": "I suggest we go to the park."
    },
    {
        "word": "summer",
        "definition": "The season after spring and before autumn, in which temperatures are hottest.",
        "example": "We go on vacation in the summer."
    },
    {
        "word": "support",
        "definition": "To bear all or part of the weight of; to give assistance to.",
        "example": "The pillars support the roof. / I support your decision."
    },
    {
        "word": "sure",
        "definition": "Confident in one’s own abilities or statement; certain.",
        "example": "I am sure about the answer."
    },
    {
        "word": "surface",
        "definition": "The outside part or uppermost layer of something.",
        "example": "The surface of the water was calm."
    },
    {
        "word": "system",
        "definition": "A set of connected things or parts forming a complex whole; a set of principles or procedures according to which something is done. 9",
        "example": "The human body is a complex system. / They implemented a new system."
    },
    {
        "word": "table",
        "definition": "A piece of furniture with a flat top and one or more legs, used as a surface for eating from, writing on, or on which to place things.",
        "example": "Put the books on the table."
    },
    {
        "word": "take",
        "definition": "To lay hold of something with one’s hands; to pick up or lift; to carry or bring.",
        "example": "Please take your umbrella. / Take me to the train station."
    },
    {
        "word": "talk",
        "definition": "To speak in order to give information or express ideas or feelings; a conversation or discussion.",
        "example": "We need to talk. / We had a long talk."
    },
    {
        "word": "task",
        "definition": "A piece of work to be done or undertaken.",
        "example": "This is an important task."
    },
    {
        "word": "tax",
        "definition": "A compulsory contribution to state revenue, levied by the government on workers’ income and business profits, or added to the cost of some goods, services, and transactions. 10",
        "example": "You need to pay your taxes."
    },
    {
        "word": "teach",
        "definition": "To show or explain to someone how to do something; to give lessons to.",
        "example": "She teaches English."
    },
    {
        "word": "teacher",
        "definition": "A person who teaches, especially in a school.",
        "example": "My favorite teacher is Mr. Lee."
    },
    {
        "word": "team",
        "definition": "A group of people who work together, especially in a sport or game.",
        "example": "Our football team won the match."
    },
    {
        "word": "technology",
        "definition": "The application of scientific knowledge for practical purposes.",
        "example": "New technology is changing our lives."
    },
    {
        "word": "television",
        "definition": "An electronic device used for receiving broadcast visual and audible signals; the broadcasting of programs for reception on a television.",
        "example": "We watched the news on television."
    },
    {
        "word": "tell",
        "definition": "To communicate information, facts, or news to someone.",
        "example": "Please tell me the truth."
    },
    {
        "word": "ten",
        "definition": "The number equivalent to the sum of five and five; one more than nine.",
        "example": "There are ten fingers on two hands."
    },
    {
        "word": "tend",
        "definition": "To regularly behave in a particular way or have a characteristic.",
        "example": "He tends to be shy."
    },
    {
        "word": "term",
        "definition": "A word or phrase used to describe a thing or to express a concept; a period of time.",
        "example": "What does this term mean? / The school term ends next week."
    },
    {
        "word": "test",
        "definition": "A procedure intended to establish the quality, performance, or reliability of something; an examination of the knowledge or ability of someone.",
        "example": "We are doing a test on the new software. / I have a math test tomorrow."
    },
    {
        "word": "than",
        "definition": "Introducing the second element in a comparison.",
        "example": "He is taller than me."
    },
    {
        "word": "thank",
        "definition": "To express gratitude to someone.",
        "example": "I want to thank you for your help."
    },
    {
        "word": "that",
        "definition": "Used to identify a specific person or thing observed or mentioned; used to introduce a subordinate clause.",
        "example": "Look at that bird. / I know that he is coming."
    },
    {
        "word": "the",
        "definition": "Used to refer to a specific person or thing previously mentioned, in the process of being mentioned, or easily identified.",
        "example": "The sun is shining."
    },
    {
        "word": "their",
        "definition": "Belonging to or associated with people or things previously mentioned or easily identified.",
        "example": "This is their house."
    },
    {
        "word": "them",
        "definition": "Used as the object of a verb or preposition to refer to people or things previously mentioned or easily identified.",
        "example": "I saw them at the park."
    },
    {
        "word": "themselves",
        "definition": "Used as a reflexive pronoun; used for emphasis.",
        "example": "They helped themselves. / They did it themselves."
    },
    {
        "word": "then",
        "definition": "At that time; after that; next.",
        "example": "He was young then. / Finish your homework, then you can play."
    },
    {
        "word": "theory",
        "definition": "A system of ideas intended to explain something, especially one based on general principles independent of the thing to be explained.",
        "example": "He has a theory about what happened."
    },
    {
        "word": "there",
        "definition": "In, at, or to that place or position; used to introduce a sentence or clause.",
        "example": "Put the book over there. / There is a problem."
    },
    {
        "word": "these",
        "definition": "Used to identify a specific person or thing observed or mentioned.",
        "example": "Look at these flowers."
    },
    {
        "word": "they",
        "definition": "Used to refer to a group of people or things previously mentioned or easily identified.",
        "example": "They are coming to the party."
    },
    {
        "word": "thing",
        "definition": "An object that is not alive and does not have consciousness; an inanimate object.",
        "example": "What is that thing?"
    },
    {
        "word": "think",
        "definition": "To have a particular opinion, belief, or idea; to ponder or consider.",
        "example": "What do you think? / I need to think about it."
    },
    {
        "word": "third",
        "definition": "Constituting number three in a sequence.",
        "example": "This is the third time this has happened."
    },
    {
        "word": "this",
        "definition": "Used to identify a specific person or thing observed or mentioned.",
        "example": "Look at this picture."
    },
    {
        "word": "those",
        "definition": "Used to identify a specific person or thing observed or mentioned.",
        "example": "Look at those birds."
    },
    {
        "word": "though",
        "definition": "Despite the fact that; however.",
        "example": "Though it was cold, we went out. / It’s difficult, though."
    },
    {
        "word": "thought",
        "definition": "An idea or opinion produced by thinking; the process of thinking.",
        "example": "I had a strange thought. / He was deep in thought."
    },
    {
        "word": "thousand",
        "definition": "The number equivalent to the product of a hundred and ten; 1,000.",
        "example": "There are one thousand meters in a kilometer."
    },
    {
        "word": "threat",
        "definition": "A statement of an intention to inflict pain, injury, damage, or other hostile action on someone in anticipation of an unwelcome result.",
        "example": "He received a threat."
    },
    {
        "word": "three",
        "definition": "The number equivalent to the sum of one and two; one more than two.",
        "example": "I have three books."
    },
    {
        "word": "through",
        "definition": "Moving in one side and out of the other side of (an opening, channel, or location); by means of.",
        "example": "The train went through the tunnel. / He succeeded through hard work."
    },
    {
        "word": "throughout",
        "definition": "In every part of (an area or object); all through a period of time.",
        "example": "The disease spread throughout the country. / It rained throughout the night."
    },
    {
        "word": "throw",
        "definition": "To propel (something) with great force in a particular direction.",
        "example": "Throw the ball to me."
    },
    {
        "word": "thus",
        "definition": "In this way; therefore.",
        "example": "He worked hard and thus passed the exam."
    },
    {
        "word": "time",
        "definition": "The indefinite continued progress of existence and events in the past, present, and future regarded as a whole; a point 11 or period when something happens.",
        "example": "We don’t have much time. / What time is it?"
    },
    {
        "word": "to",
        "definition": "Expressing motion in the direction of (a particular location); indicating the recipient of an action.",
        "example": "We are going to the park. / Give it to me."
    },
    {
        "word": "today",
        "definition": "On this present day.",
        "example": "I have a lot to do today."
    },
    {
        "word": "together",
        "definition": "With or near each other.",
        "example": "They went to the store together."
    },
    {
        "word": "tonight",
        "definition": "On the evening or night of the present day.",
        "example": "We are eating out tonight."
    },
    {
        "word": "too",
        "definition": "In addition; also; to a greater extent than is desirable, permissible, or possible.",
        "example": "I want to come too. / It’s too expensive."
    },
    {
        "word": "top",
        "definition": "The highest or uppermost point, part, or surface of something.",
        "example": "Put the book on the top shelf."
    },
    {
        "word": "total",
        "definition": "Comprising in all; the whole amount.",
        "example": "What is the total cost? / The total was $50."
    },
    {
        "word": "tough",
        "definition": "Strong enough to withstand adverse conditions or rough handling; difficult and requiring physical or mental strength.",
        "example": "The meat was tough. / It was a tough decision."
    },
    {
        "word": "toward",
        "definition": "In the direction of.",
        "example": "He walked toward the house."
    },
    {
        "word": "town",
        "definition": "A built-up area with a name, defined boundaries, and a local government.",
        "example": "We live in a small town."
    },
    {
        "word": "trade",
        "definition": "The action of buying and selling goods and services; a skilled craft.",
        "example": "International trade is important. / He is a skilled tradesman."
    },
    {
        "word": "traditional",
        "definition": "Existing in or as part of a tradition; long-established.",
        "example": "They follow traditional customs."
    },
    {
        "word": "training",
        "definition": "The action of teaching a person or animal a particular skill or type of behavior.",
        "example": "He is undergoing intense training."
    },
    {
        "word": "travel",
        "definition": "To go from one place to another.",
        "example": "I love to travel."
    },
    {
        "word": "treat",
        "definition": "To behave towards or deal with in a certain way; an event or item that is out of the ordinary and gives great pleasure.",
        "example": "Please treat others with respect. / We are having ice cream as a treat."
    },
    {
        "word": "treatment",
        "definition": "The manner in which someone behaves toward or deals with someone or something; the action or manner of dealing with something.",
        "example": "He received medical treatment. / The treatment of the subject was thorough."
    },
    {
        "word": "tree",
        "definition": "A woody perennial plant, typically with a single trunk growing to a considerable height and bearing lateral branches at some distance from the ground.",
        "example": "The birds are singing in the tree."
    },
    {
        "word": "trial",
        "definition": "A formal examination of evidence in court; a test of the performance, qualities, or suitability of someone or something.",
        "example": "The suspect is on trial. / They conducted a clinical trial."
    },
    {
        "word": "trip",
        "definition": "A journey or excursion, especially for pleasure.",
        "example": "We went on a trip to the mountains."
    },
    {
        "word": "trouble",
        "definition": "Difficulty or problems.",
        "example": "We are having some trouble."
    },
    {
        "word": "TRUE",
        "definition": "In accordance with fact or reality; genuine.",
        "example": "This statement is true. / He is a true friend."
    },
    {
        "word": "truth",
        "definition": "The quality or state of being true.",
        "example": "Tell me the truth."
    },
    {
        "word": "try",
        "definition": "To attempt to do something; to make an effort.",
        "example": "Try to solve the problem."
    },
    {
        "word": "turn",
        "definition": "To move in a circular direction; to change direction.",
        "example": "Turn the handle. / Turn left at the corner."
    },
    {
        "word": "TV",
        "definition": "Television.",
        "example": "I watched TV last night."
    },
    {
        "word": "two",
        "definition": "The number equivalent to the sum of one and one; one more than one.",
        "example": "I have two cats."
    },
    {
        "word": "type",
        "definition": "A category of people or things having common characteristics.",
        "example": "What type of music do you like?"
    },
    {
        "word": "under",
        "definition": "Situated directly below (something); beneath.",
        "example": "The cat is under the table."
    },
    {
        "word": "understand",
        "definition": "To perceive the intended meaning of someone or something.",
        "example": "Do you understand?"
    },
    {
        "word": "unit",
        "definition": "A single thing or person; a component of a larger whole.",
        "example": "The family is a basic unit of society. / The metric units are used."
    },
    {
        "word": "until",
        "definition": "Up to the point in time that.",
        "example": "I will wait until you arrive."
    },
    {
        "word": "up",
        "definition": "Toward a higher place; in or into a higher position.",
        "example": "Go up the stairs."
    },
    {
        "word": "upon",
        "definition": "Formal usage of on.",
        "example": "The book is upon the table."
    },
    {
        "word": "us",
        "definition": "Used by a speaker to refer to himself or herself and one or more other people as the object of a verb or preposition. 12",
        "example": "Come with us."
    },
    {
        "word": "use",
        "definition": "To take, hold, or deploy (something) as a means of accomplishing a purpose or achieving a result; the act of using.",
        "example": "Can I use your pen? / The use of this tool is prohibited."
    },
    {
        "word": "usually",
        "definition": "Under normal conditions; most of the time.",
        "example": "He usually wakes up early."
    },
    {
        "word": "value",
        "definition": "The regard that something is held to deserve; the importance, worth, or usefulness of something; to consider someone or something to be important.",
        "example": "The value of the house increased. / I value your friendship."
    },
    {
        "word": "various",
        "definition": "Of different kinds; diverse.",
        "example": "There are various options available."
    },
    {
        "word": "very",
        "definition": "In a high degree; extremely.",
        "example": "She is very kind."
    },
    {
        "word": "victim",
        "definition": "A person harmed, injured, or killed as a result of a crime, accident, or other event or action.",
        "example": "The victim was taken to the hospital."
    },
    {
        "word": "view",
        "definition": "The ability to see something or to be seen from a particular place; a way of regarding or considering something.",
        "example": "The view from the window is beautiful. / What is your view on this matter?"
    },
    {
        "word": "violence",
        "definition": "Behavior involving physical force intended to hurt, damage, or kill someone or something.",
        "example": "The film contained a lot of violence."
    },
    {
        "word": "visit",
        "definition": "To go to see and spend time with someone or somewhere; an act of visiting.",
        "example": "We plan to visit our grandparents. / They paid a brief visit."
    },
    {
        "word": "voice",
        "definition": "The sound produced in a person’s larynx and uttered through the mouth, as speech or song.",
        "example": "She has a beautiful singing voice."
    },
    {
        "word": "vote",
        "definition": "A formal indication of a choice between two or more candidates or courses of action, expressed by ballot or a show of hands; to give or register a vote.",
        "example": "Every citizen has the right to vote. / He voted for the new law."
    },
    {
        "word": "wait",
        "definition": "To stay where one is or delay action until a particular time or until someone or something comes.",
        "example": "Please wait here."
    },
    {
        "word": "walk",
        "definition": "To move at a regular pace by lifting and setting down each foot in turn, never having both feet off the ground at once; an act of 13 walking.",
        "example": "Let’s go for a walk. / He walked to the store."
    },
    {
        "word": "wall",
        "definition": "A continuous vertical brick or stone structure that encloses or divides an area of land or forms a side of a building.",
        "example": "The wall is painted blue."
    },
    {
        "word": "want",
        "definition": "To have a desire to possess or do (something); wish for.",
        "example": "I want a cup of coffee."
    },
    {
        "word": "war",
        "definition": "A state of armed conflict between different countries or different groups within a country.",
        "example": "The country is at war."
    },
    {
        "word": "watch",
        "definition": "To look at attentively for a period of time; a small timepiece worn on the wrist.",
        "example": "Let’s watch a movie. / My watch is broken."
    },
    {
        "word": "water",
        "definition": "A colorless, transparent, odorless liquid that forms the seas, lakes, rivers, and rain and is the basis of the fluids of 14 living organisms.",
        "example": "Please give me some water."
    },
    {
        "word": "way",
        "definition": "A method, style, or manner of doing something; a road, track, or path.",
        "example": "What is the best way to solve this? / Show me the way."
    },
    {
        "word": "we",
        "definition": "Used by a speaker to refer to himself or herself and one or more other people considered together.",
        "example": "We are going to the park."
    },
    {
        "word": "weapon",
        "definition": "A thing designed or used for inflicting bodily harm or physical damage.",
        "example": "He was carrying a weapon."
    },
    {
        "word": "wear",
        "definition": "To have on one’s body as clothing, decoration, or protection; to deteriorate through use or friction.",
        "example": "What are you going to wear? / The carpet is starting to wear out."
    },
    {
        "word": "week",
        "definition": "A period of seven days.",
        "example": "I will see you next week."
    },
    {
        "word": "weight",
        "definition": "A body’s relative mass or the quantity of matter contained by it, giving rise to a downward force; heaviness.",
        "example": "What is your weight?"
    },
    {
        "word": "well",
        "definition": "In a good or satisfactory manner; in good health.",
        "example": "He plays the piano well. / I am feeling well."
    },
    {
        "word": "west",
        "definition": "The direction toward the point of the horizon where the sun sets at the equinoxes.",
        "example": "The sun sets in the west."
    },
    {
        "word": "western",
        "definition": "Situated in or facing the west.",
        "example": "They live in a western country."
    },
    {
        "word": "what",
        "definition": "Asking for information specifying something; asking about the nature of someone or something.",
        "example": "What is your name? / What a beautiful day!"
    },
    {
        "word": "whatever",
        "definition": "Anything that; no matter what.",
        "example": "Take whatever you need."
    },
    {
        "word": "when",
        "definition": "At what time; at the time that.",
        "example": "When are you leaving? / I was sleeping when you called."
    },
    {
        "word": "where",
        "definition": "In or to what place or position; in or to the place or situation in which.",
        "example": "Where do you live? / This is where I work."
    },
    {
        "word": "whether",
        "definition": "Expressing a doubt or choice between alternatives.",
        "example": "I don’t know whether to go or stay."
    },
    {
        "word": "which",
        "definition": "Asking for information specifying one or more people or things from a definite set; used to introduce a non-restrictive relative clause.",
        "example": "Which color do you prefer? / This is the house, which I bought last year."
    },
    {
        "word": "while",
        "definition": "During the time that; a period of time.",
        "example": "While I was eating, the phone rang. / I haven’t seen him for a while."
    },
    {
        "word": "white",
        "definition": "Of the color of milk or fresh snow; a color at one extreme end of the spectrum of visible light, opposite to black.",
        "example": "She wore a white dress."
    },
    {
        "word": "who",
        "definition": "Asking what or which person or people; used to introduce a relative clause referring to a person or people.",
        "example": "Who is that person? / This is the man who helped me."
    },
    {
        "word": "whole",
        "definition": "All of; entire.",
        "example": "He ate the whole cake."
    },
    {
        "word": "whom",
        "definition": "Used instead of ‘who’ as the object of a verb or preposition.",
        "example": "To whom should I address the letter?"
    },
    {
        "word": "whose",
        "definition": "Asking whose or to whom something belongs; used to introduce a relative clause indicating possession.",
        "example": "Whose book is this? / This is the man whose car was stolen."
    },
    {
        "word": "why",
        "definition": "For what reason or purpose.",
        "example": "Why are you late?"
    },
    {
        "word": "wide",
        "definition": "Of great or more than average width.",
        "example": "The river is very wide."
    },
    {
        "word": "wife",
        "definition": "A married woman considered in relation to her spouse.",
        "example": "His wife is a doctor."
    },
    {
        "word": "will",
        "definition": "Expressing the future tense; expressing a strong intention or assertion.",
        "example": "I will go to the park tomorrow. / I will succeed."
    },
    {
        "word": "win",
        "definition": "To achieve victory in a contest or competition.",
        "example": "Our team will win the game."
    },
    {
        "word": "wind",
        "definition": "The natural movement of the air, especially in the form of a current of air blowing from a particular direction.",
        "example": "The 15 wind was blowing strongly."
    },
    {
        "word": "window",
        "definition": "An opening in the wall or roof of a building or vehicle that is fitted with a frame of glass or other transparent material to admit light or air and allow people to see through.",
        "example": "Please open the window."
    },
    {
        "word": "wish",
        "definition": "To want something to happen or be the case; a desire or hope.",
        "example": "I wish I could fly. / Make a wish."
    },
    {
        "word": "with",
        "definition": "Accompanied by (another person or thing); in the same direction as.",
        "example": "I went to the movie with my friends. / Go with the flow."
    },
    {
        "word": "within",
        "definition": "Inside (something); not further off than (a particular distance or limit).",
        "example": "He is within the building. / The answer is within your grasp."
    },
    {
        "word": "without",
        "definition": "Not having or doing something; in the absence of.",
        "example": "He left without saying goodbye."
    },
    {
        "word": "woman",
        "definition": "An adult female human being.",
        "example": "The woman is carrying a bag."
    },
    {
        "word": "wonder",
        "definition": "A feeling of amazement and admiration; to desire or be curious to know something.",
        "example": "He looked at the stars with wonder. / I wonder if he will come."
    },
    {
        "word": "word",
        "definition": "A single distinct meaningful element of speech or writing, used with others to form a sentence and typically shown with a space on either side when written or printed. 16",
        "example": "Please write the word on the board."
    },
    {
        "word": "work",
        "definition": "Activity involving mental or physical effort done in order to achieve a purpose or result; to perform a task.",
        "example": "He has a lot of work to do. / I work as a teacher."
    },
    {
        "word": "worker",
        "definition": "A person who does a specified type of work or who works in a specified way.",
        "example": "Factory workers were on strike."
    },
    {
        "word": "world",
        "definition": "The earth, together with all of its countries and peoples.",
        "example": "It’s a beautiful world."
    },
    {
        "word": "worry",
        "definition": "To feel or cause to feel anxious or troubled about actual or potential problems.",
        "example": "Don’t worry about it."
    },
    {
        "word": "would",
        "definition": "Used to indicate the conditional or hypothetical mood; used to express a polite request.",
        "example": "I would like to go. / Would you please help me?"
    },
    {
        "word": "write",
        "definition": "To mark letters, words, or other symbols on a surface; to compose a letter, book, etc.",
        "example": "Please write your name here. / She is writeing a novel."
    },
    {
        "word": "writer",
        "definition": "A person who has written a particular text; a person who writes books, stories, or articles as a job.",
        "example": "He is a famous writer."
    },
    {
        "word": "wrong",
        "definition": "Not correct or true; incorrect.",
        "example": "That answer is wrong."
    },
    {
        "word": "yard",
        "definition": "A unit of linear measure equal to 3 feet; a piece of ground adjoining a house or other building.",
        "example": "The fabric is three yards long. / The children played in the yard."
    },
    {
        "word": "yeah",
        "definition": "Informal way of saying yes.",
        "example": "Yeah, I can do that."
    },
    {
        "word": "year",
        "definition": "The period of 365 or 366 days divided into 12 months.",
        "example": "It was a good year."
    },
    {
        "word": "yes",
        "definition": "Used to give an affirmative response.",
        "example": "Yes, I will be there."
    },
    {
        "word": "yet",
        "definition": "Up until the present or a specified or implied time; nevertheless; in addition.",
        "example": "He hasn’t finished yet. / It was cold, yet sunny. / There is one more thing yet to consider."
    },
    {
        "word": "you",
        "definition": "Used to refer to the person or people that the speaker is addressing.",
        "example": "You are a good student."
    },
    {
        "word": "young",
        "definition": "Having lived or existed for only a short time; not old.",
        "example": "He is a young man."
    },
    {
        "word": "your",
        "definition": "Belonging to or associated with the person or people that the speaker is addressing.",
        "example": "This is your book."
    },
    {
        "word": "yourself",
        "definition": "Used as a reflexive pronoun; used for emphasis.",
        "example": "Help yourself to food. / Did you do it yourself?"
    }
]